{"contributing":0,"vllm":1,"you":2,"may":3,"find":4,"information":5,"about":6,"docs":7,"ai":8,"https":9,"en":10,"latest":11,"markdownlint":12,"disable":13,"md001":14,"md041":15,"align":16,"center":17,"picture":18,"source":19,"media":20,"prefers":21,"color":22,"scheme":23,"dark":24,"srcset":25,"raw":26,"githubusercontent":27,"com":28,"project":29,"main":30,"assets":31,"logos":32,"logo":33,"text":34,"png":35,"img":36,"alt":37,"src":38,"light":39,"width":40,"55":41,"h3":42,"easy":43,"fast":44,"cheap":45,"llm":46,"serving":47,"everyone":48,"href":49,"documentation":50,"blog":51,"arxiv":52,"org":53,"abs":54,"2309":55,"06180":56,"paper":57,"vllm_project":58,"twitter":59,"discuss":60,"user":61,"forum":62,"slack":63,"developer":64,"news":65,"2025":66,"08":67,"we":68,"hosted":69,"beijing":70,"meetup":71,"mp":72,"weixin":73,"qq":74,"dgkwg1wfpwgo2jcdtqqhxa":75,"focusing":76,"large":77,"scale":78,"deployment":79,"please":80,"slides":81,"here":82,"drive":83,"google":84,"folders":85,"1pid6nsflu43dzri0eatcpgxsazdvbbqf":86,"recording":87,"www":88,"chaspark":89,"live":90,"1166916873711665152":91,"05":92,"nyc":93,"lu":94,"ma":95,"c1rqyf1f":96,"presentation":97,"1_q_aw_iomjwuimf1s1ym":98,"zhjxz8cuel0ijvaquoybea":99,"edit":100,"usp":101,"sharing":102,"now":103,"under":104,"pytorch":105,"foundation":106,"announcement":107,"welcomes":108,"01":109,"excited":110,"announce":111,"alpha":112,"release":113,"v1":114,"major":115,"architectural":116,"upgrade":117,"7x":118,"speedup":119,"clean":120,"code":121,"optimized":122,"execution":123,"loop":124,"zero":125,"overhead":126,"prefix":127,"caching":128,"enhanced":129,"multimodal":130,"support":131,"more":132,"check":133,"out":134,"our":135,"post":136,"27":137,"html":138,"details":139,"summary":140,"previous":141,"04":142,"asia":143,"day":144,"sginnovate":145,"event":146,"limited":147,"availability":148,"morning":149,"evening":150,"slots":151,"remaining":152,"inaugural":153,"from":154,"team":155,"19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo":156,"03":157,"ollama":158,"inference":159,"night":160,"16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u":161,"first":162,"china":163,"n77gibl2coratqhtveazfg":164,"1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq":165,"east":166,"coast":167,"7mu4k4xx":168,"1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs":169,"slide":170,"id":171,"g31441846c39_0_0":172,"02":173,"ninth":174,"h7g3kuj9":175,"meta":176,"1jzc_pzvxrvnsfvcw":177,"v4cfxb6pn7zz2cyp_flwo05aqg":178,"amd":179,"file":180,"1zk5qejiktmlq2eqcxqzlljax3m9s7nwn":181,"view":182,"posted":183,"eighth":184,"zep56hui":185,"cloud":186,"1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4":187,"1h24phewanyrl11xy5dxubvrc9f9kkjix":188,"2024":189,"12":190,"joins":191,"ecosystem":192,"11":193,"seventh":194,"h0qvrajz":195,"snowflake":196,"1e3cxqbv3jsfgp30swyvs3em_tw":197,"ghohj9pajgk6kr54":198,"1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a":199,"10":200,"have":201,"just":202,"created":203,"coordinating":204,"contributions":205,"discussing":206,"features":207,"feel":208,"free":209,"join":210,"us":211,"ray":212,"summit":213,"held":214,"special":215,"track":216,"opening":217,"talk":218,"1b_kqxphbtra_mdf":219,"tr6i8rwdou5qotznceg2mkzxehm":220,"learn":221,"talks":222,"youtube":223,"playlist":224,"list":225,"plztswpqnepxl6aqwifuwuimlpfrvpksjr":226,"other":227,"contributors":228,"users":229,"09":230,"sixth":231,"87q3nvnh":232,"nvidia":233,"1wrlgwytqfaotd5wcgspnhoaw3nq0e":234,"9wqyp7ny93xrs":235,"07":236,"fifth":237,"lp0gyjqr":238,"aws":239,"1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y":240,"partnership":241,"officially":242,"supports":243,"llama":244,"fp8":245,"quantization":246,"pipeline":247,"parallelism":248,"23":249,"llama31":250,"06":251,"fourth":252,"agivllm":253,"cloudflare":254,"bentoml":255,"1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4":256,"third":257,"robloxandvllmmeetup2024":258,"splashthat":259,"roblox":260,"1a":261,"47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem":262,"second":263,"ygxbpzhl":264,"ibm":265,"12mi2skabnuw5rbwxdyy":266,"hthth4imsnceoq10jdqbxga":267,"2023":268,"a16z":269,"1ql":270,"xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s":271,"would":272,"like":273,"express":274,"sincere":275,"gratitude":276,"andreessen":277,"horowitz":278,"30":279,"supporting":280,"open":281,"community":282,"providing":283,"generous":284,"grant":285,"development":286,"research":287,"released":288,"fastchat":289,"integration":290,"has":291,"powered":292,"lmsys":293,"vicuna":294,"chatbot":295,"arena":296,"chat":297,"since":298,"mid":299,"april":300,"use":301,"library":302,"originally":303,"developed":304,"sky":305,"computing":306,"lab":307,"cs":308,"berkeley":309,"edu":310,"uc":311,"evolved":312,"driven":313,"both":314,"academia":315,"industry":316,"state":317,"art":318,"throughput":319,"efficient":320,"management":321,"attention":322,"key":323,"value":324,"memory":325,"pagedattention":326,"20":327,"continuous":328,"batching":329,"incoming":330,"requests":331,"model":332,"cuda":333,"hip":334,"graph":335,"quantizations":336,"gptq":337,"2210":338,"17323":339,"awq":340,"2306":341,"00978":342,"autoround":343,"05516":344,"int4":345,"int8":346,"kernels":347,"including":348,"flashattention":349,"flashinfer":350,"speculative":351,"decoding":352,"chunked":353,"prefill":354,"flexible":355,"seamless":356,"popular":357,"hugging":358,"face":359,"models":360,"high":361,"various":362,"algorithms":363,"parallel":364,"sampling":365,"beam":366,"search":367,"tensor":368,"data":369,"expert":370,"distributed":371,"streaming":372,"outputs":373,"openai":374,"compatible":375,"api":376,"server":377,"gpus":378,"cpus":379,"intel":380,"powerpc":381,"tpu":382,"neuron":383,"multi":384,"lora":385,"seamlessly":386,"most":387,"huggingface":388,"transformer":389,"llms":390,"mixture":391,"mixtral":392,"deepseek":393,"v2":394,"v3":395,"embedding":396,"e5":397,"mistral":398,"modal":399,"llava":400,"full":401,"supported":402,"supported_models":403,"getting":404,"started":405,"install":406,"pip":407,"getting_started":408,"installation":409,"gpu":410,"index":411,"build":412,"wheel":413,"bash":414,"visit":415,"quickstart":416,"welcome":417,"any":418,"collaborations":419,"how":420,"get":421,"involved":422,"sponsors":423,"compute":424,"resources":425,"testing":426,"following":427,"organizations":428,"thank":429,"your":430,"note":431,"sort":432,"them":433,"alphabetical":434,"order":435,"keep":436,"consistent":437,"md":438,"cash":439,"donations":440,"dropbox":441,"sequoia":442,"capital":443,"skywork":444,"zhenfund":445,"alibaba":446,"anyscale":447,"crusoe":448,"databricks":449,"deepinfra":450,"lambda":451,"nebius":452,"novita":453,"replicate":454,"runpod":455,"trainy":456,"san":457,"diego":458,"sponsor":459,"also":460,"official":461,"fundraising":462,"venue":463,"through":464,"opencollective":465,"plan":466,"fund":467,"maintenance":468,"adoption":469,"citation":470,"cite":471,"bibtex":472,"inproceedings":473,"kwon2023efficient":474,"title":475,"language":476,"author":477,"woosuk":478,"kwon":479,"zhuohan":480,"li":481,"siyuan":482,"zhuang":483,"ying":484,"sheng":485,"lianmin":486,"zheng":487,"cody":488,"hao":489,"yu":490,"joseph":491,"gonzalez":492,"zhang":493,"ion":494,"stoica":495,"booktitle":496,"proceedings":497,"acm":498,"sigops":499,"29th":500,"symposium":501,"operating":502,"systems":503,"principles":504,"year":505,"contact":506,"start":507,"technical":508,"questions":509,"feature":510,"github":511,"issues":512,"fellow":513,"security":514,"disclosures":515,"advisories":516,"partnerships":517,"lists":518,"mailto":519,"end":520,"kit":521,"wish":522,"refer":523,"repo":524,"releasing":525,"releases":526,"offer":527,"reliable":528,"version":529,"base":530,"packaged":531,"binary":532,"format":533,"can":534,"conveniently":535,"accessed":536,"via":537,"pypi":538,"serve":539,"milestones":540,"communicate":541,"newly":542,"available":543,"improvements":544,"upcoming":545,"changes":546,"could":547,"affect":548,"potential":549,"breaking":550,"versioning":551,"uses":552,"right":553,"shifted":554,"where":555,"new":556,"patch":557,"every":558,"weeks":559,"contain":560,"bug":561,"fixes":562,"opposed":563,"semver":564,"contains":565,"only":566,"backwards":567,"when":568,"critical":569,"need":570,"made":571,"post1":572,"_major_":573,"milestone":574,"incompatible":575,"similar":576,"_minor_":577,"_patch_":578,"_post1_":579,"_patch":580,"1_":581,"either":582,"explicit":583,"implicit":584,"cadence":585,"bi":586,"weekly":587,"basis":588,"days":589,"after":590,"same":591,"branch":592,"all":593,"future":594,"dates":595,"below":596,"tentative":597,"optional":598,"date":599,"versions":600,"jan":601,"feb":602,"mar":603,"apr":604,"jun":605,"jul":606,"13":607,"aug":608,"14":609,"15":610,"sep":611,"16":612,"17":613,"oct":614,"18":615,"19":616,"nov":617,"21":618,"dec":619,"22":620,"each":621,"built":622,"dedicated":623,"cut":624,"performed":625,"before":626,"previously":627,"reused":628,"builds":629,"triggered":630,"push":631,"rc":632,"tag":633,"vx":634,"rc1":635,"enables":636,"test":637,"multiple":638,"rcs":639,"final":640,"does":641,"trigger":642,"used":643,"notes":644,"monitor":645,"reverts":646,"apply":647,"cherry":648,"pick":649,"criteria":650,"approach":651,"finalizing":652,"clear":653,"what":654,"picks":655,"allowed":656,"process":657,"land":658,"pr":659,"typically":660,"ensure":661,"sufficient":662,"time":663,"complete":664,"thorough":665,"round":666,"stable":667,"regression":668,"address":669,"functional":670,"performance":671,"against":672,"recent":673,"severe":674,"issue":675,"silent":676,"incorrectness":677,"compatibility":678,"crashes":679,"deadlocks":680,"leaks":681,"introduced":682,"specific":683,"change":684,"identifiers":685,"ci":686,"work":687,"prs":688,"considered":689,"merged":690,"trunk":691,"exception":692,"manual":693,"validations":694,"e2e":695,"validation":696,"perform":697,"regressions":698,"benchmark":699,"workflow":700,"actions":701,"workflows":702,"yml":703,"current":704,"coverage":705,"llama3":706,"llama4":707,"hardware":708,"h100":709,"mi300x":710,"_note":711,"based":712,"availability_":713,"step":714,"access":715,"request":716,"write":717,"repository":718,"run":719,"review":720,"setup":721,"familiarize":722,"yourself":723,"configurations":724,"tree":725,"benchmarks":726,"rocm":727,"navigate":728,"configure":729,"set":730,"v0":731,"commit":732,"hash":733,"results":734,"once":735,"completes":736,"dashboard":737,"hud":738,"reponame":739,"2fvllm":740,"corresponding":741,"comparison":742,"compare":743,"verify":744,"occurred":745,"example":746,"vs":747,"starttime":748,"thu":749,"2c":750,"2017":751,"20apr":752,"202025":753,"2021":754,"3a43":755,"3a50":756,"20gmt":757,"stoptime":758,"wed":759,"2016":760,"20jul":761,"granularity":762,"week":763,"lbranch":764,"lcommit":765,"b6553be1bc75f046b00046a4ad7576364d03c835":766,"rbranch":767,"rcommit":768,"a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f":769,"benchmarkname":770,"modelname":771,"20models":772,"backendname":773,"20backends":774,"modename":775,"20modes":776,"dtypename":777,"20dtype":778,"devicename":779,"20devices":780,"archname":781,"20platforms":782,"conduct":783,"pledge":784,"members":785,"leaders":786,"make":787,"participation":788,"harassment":789,"experience":790,"regardless":791,"age":792,"body":793,"size":794,"visible":795,"invisible":796,"disability":797,"ethnicity":798,"sex":799,"characteristics":800,"gender":801,"identity":802,"expression":803,"level":804,"education":805,"socioeconomic":806,"status":807,"nationality":808,"personal":809,"appearance":810,"race":811,"caste":812,"religion":813,"sexual":814,"orientation":815,"act":816,"interact":817,"ways":818,"contribute":819,"welcoming":820,"diverse":821,"inclusive":822,"healthy":823,"standards":824,"examples":825,"behavior":826,"contributes":827,"positive":828,"environment":829,"include":830,"demonstrating":831,"empathy":832,"kindness":833,"toward":834,"people":835,"being":836,"respectful":837,"differing":838,"opinions":839,"viewpoints":840,"experiences":841,"giving":842,"gracefully":843,"accepting":844,"constructive":845,"feedback":846,"responsibility":847,"apologizing":848,"those":849,"affected":850,"mistakes":851,"learning":852,"best":853,"individuals":854,"overall":855,"unacceptable":856,"sexualized":857,"imagery":858,"advances":859,"kind":860,"trolling":861,"insulting":862,"derogatory":863,"comments":864,"political":865,"attacks":866,"public":867,"private":868,"publishing":869,"others":870,"physical":871,"email":872,"without":873,"permission":874,"which":875,"reasonably":876,"inappropriate":877,"professional":878,"setting":879,"enforcement":880,"responsibilities":881,"responsible":882,"clarifying":883,"enforcing":884,"acceptable":885,"take":886,"appropriate":887,"fair":888,"corrective":889,"action":890,"response":891,"deem":892,"threatening":893,"offensive":894,"harmful":895,"remove":896,"reject":897,"commits":898,"wiki":899,"edits":900,"aligned":901,"reasons":902,"moderation":903,"decisions":904,"scope":905,"applies":906,"within":907,"spaces":908,"individual":909,"representing":910,"using":911,"posting":912,"social":913,"account":914,"acting":915,"appointed":916,"representative":917,"online":918,"offline":919,"irl":920,"instances":921,"abusive":922,"harassing":923,"otherwise":924,"reported":925,"channel":926,"complaints":927,"reviewed":928,"investigated":929,"promptly":930,"fairly":931,"obligated":932,"respect":933,"privacy":934,"reporter":935,"incident":936,"guidelines":937,"follow":938,"impact":939,"determining":940,"consequences":941,"violation":942,"correction":943,"deemed":944,"unprofessional":945,"unwelcome":946,"consequence":947,"written":948,"warning":949,"clarity":950,"around":951,"nature":952,"explanation":953,"why":954,"apology":955,"requested":956,"single":957,"series":958,"continued":959,"interaction":960,"unsolicited":961,"specified":962,"period":963,"includes":964,"avoiding":965,"interactions":966,"well":967,"external":968,"channels":969,"violating":970,"terms":971,"lead":972,"temporary":973,"permanent":974,"ban":975,"serious":976,"sustained":977,"communication":978,"during":979,"pattern":980,"aggression":981,"disparagement":982,"classes":983,"attribution":984,"adapted":985,"contributor":986,"covenant":987,"code_of_conduct":988,"were":989,"inspired":990,"mozilla":991,"ladder":992,"inclusion":993,"answers":994,"common":995,"see":996,"faq":997,"translations":998,"policy":999,"reporting":1000,"report":1001,"privately":1002,"vulnerability":1003,"submission":1004,"form":1005,"triage":1006,"reports":1007,"triaged":1008,"vulnerability_management":1009,"threat":1010,"guide":1011,"usage":1012,"assumptions":1013,"recommendations":1014,"blob":1015,"securely":1016,"severity":1017,"determine":1018,"risk":1019,"taking":1020,"dealing":1021,"past":1022,"defaults":1023,"cases":1024,"categories":1025,"vulnerabilities":1026,"allow":1027,"remote":1028,"attackers":1029,"execute":1030,"arbitrary":1031,"control":1032,"system":1033,"significantly":1034,"compromise":1035,"confidentiality":1036,"integrity":1037,"privileges":1038,"needed":1039,"network":1040,"deserialization":1041,"exploit":1042,"chains":1043,"generally":1044,"rated":1045,"cvss":1046,"flaws":1047,"elevated":1048,"rce":1049,"contexts":1050,"significant":1051,"loss":1052,"require":1053,"advanced":1054,"conditions":1055,"some":1056,"trust":1057,"modes":1058,"node":1059,"privileged":1060,"required":1061,"scores":1062,"between":1063,"moderate":1064,"cause":1065,"denial":1066,"service":1067,"partial":1068,"disruption":1069,"do":1070,"breach":1071,"rating":1072,"low":1073,"minor":1074,"informational":1075,"logging":1076,"errors":1077,"non":1078,"exploitable":1079,"weaknesses":1080,"local":1081,"privilege":1082,"negligible":1083,"side":1084,"collisions":1085,"often":1086,"less":1087,"than":1088,"prenotification":1089,"certain":1090,"prenotify":1091,"vendors":1092,"ship":1093,"purpose":1094,"coordinated":1095,"notification":1096,"adding":1097,"contacts":1098,"advisory":1099,"few":1100,"added":1101,"group":1102,"send":1103,"copying":1104,"vendor":1105,"analyzed":1106,"case":1107,"withdraw":1108,"receiving":1109,"prenotifications":1110,"membership":1111,"refinements":1112,"who":1113,"included":1114,"cutlass":1115,"epilogues":1116,"introduction":1117,"document":1118,"describes":1119,"implemented":1120,"fusing":1121,"de":1122,"operations":1123,"onto":1124,"gemms":1125,"currently":1126,"symmetric":1127,"weights":1128,"asymmetric":1129,"activations":1130,"quantized":1131,"per":1132,"token":1133,"scaledepilogue":1134,"bias":1135,"scaledepiloguebias":1136,"scaledepilogueazp":1137,"scaledepilogueazppertoken":1138,"reduce":1139,"instead":1140,"passed":1141,"epilogue":1142,"induces":1143,"redundant":1144,"addition":1145,"operation":1146,"runtime":1147,"underlying":1148,"linear":1149,"algebra":1150,"activation":1151,"rfc":1152,"3975":1153,"widehat":1154,"matrices":1155,"become":1156,"math":1157,"s_a":1158,"j_a":1159,"z_a":1160,"s_b":1161,"output":1162,"gemm":1163,"scales":1164,"respectively":1165,"point":1166,"matrix":1167,"ones":1168,"dimensions":1169,"additional":1170,"expanding":1171,"further":1172,"calculate":1173,"follows":1174,"left":1175,"known":1176,"ahead":1177,"row":1178,"equal":1179,"mathbf":1180,"vector":1181,"column":1182,"sums":1183,"computes":1184,"meaning":1185,"parameters":1186,"scale_a":1187,"scalar":1188,"scale_b":1189,"always":1190,"because":1191,"term":1192,"precomputed":1193,"stored":1194,"azp_with_adj":1195,"points":1196,"efficiently":1197,"must":1198,"precompute":1199,"pass":1200,"kernel":1201,"above":1202,"means":1203,"becomes":1204,"outer":1205,"product":1206,"azp_adj":1207,"adjustment":1208,"azp":1209,"performs":1210,"computation":1211,"dq":1212,"machete":1213,"mixed":1214,"precision":1215,"spiritual":1216,"successor":1217,"marlin":1218,"hopper":1219,"architectures":1220,"type":1221,"pairs":1222,"easier":1223,"add":1224,"compared":1225,"overview":1226,"effectively":1227,"python":1228,"scale_type":1229,"w_s":1230,"dtype":1231,"compute_type":1232,"w_q":1233,"w_z":1234,"weight":1235,"zeropoints":1236,"so":1237,"fma":1238,"pre":1239,"applied":1240,"supplied":1241,"assume":1242,"subtracted":1243,"optimization":1244,"prepacking":1245,"closely":1246,"match":1247,"core":1248,"layouts":1249,"allowing":1250,"wider":1251,"shared":1252,"loads":1253,"loading":1254,"prepacked":1255,"calling":1256,"machete_gemm":1257,"flow":1258,"looks":1259,"something":1260,"import":1261,"_custom_ops":1262,"ops":1263,"w_q_packed":1264,"machete_prepack_b":1265,"wtype":1266,"b_q":1267,"b_type":1268,"b_scales":1269,"b_group_size":1270,"group_size":1271,"generation":1272,"generate":1273,"different":1274,"tile":1275,"shapes":1276,"template":1277,"instantiations":1278,"py":1279,"typeconfig":1280,"appended":1281,"impl_configs":1282,"automatically":1283,"generated":1284,"assuming":1285,"provide":1286,"implconfig":1287,"bundles":1288,"scheduleconfig":1289,"specialization":1290,"default":1291,"heuristic":1292,"info":1293,"scheduler":1294,"etc":1295,"differently":1296,"problem":1297,"almost":1298,"never":1299,"one":1300,"works":1301,"beneficial":1302,"comes":1303,"should":1304,"provided":1305,"maps":1306,"schedule":1307,"parameter":1308,"define":1309,"combinations":1310,"with_zeropoints":1311,"with_scales":1312,"compile":1313,"times":1314,"limiting":1315,"hide":1316,"navigation":1317,"toc":1318,"figure":1319,"markdown":1320,"span":1321,"class":1322,"60":1323,"style":1324,"strong":1325,"script":1326,"async":1327,"defer":1328,"buttons":1329,"io":1330,"js":1331,"button":1332,"show":1333,"count":1334,"true":1335,"aria":1336,"label":1337,"star":1338,"subscription":1339,"icon":1340,"octicon":1341,"eye":1342,"watch":1343,"fork":1344,"forked":1345,"depends":1346,"looking":1347,"recommend":1348,"starting":1349,"applications":1350,"roadmap":1351,"gaudi":1352,"accelerators":1353,"power":1354,"trainium":1355,"inferentia":1356,"announcing":1357,"intro":1358,"sosp":1359,"23x":1360,"while":1361,"reducing":1362,"p50":1363,"latency":1364,"cade":1365,"daniel":1366,"et":1367,"al":1368,"meetups":1369,"incremental":1370,"compilation":1371,"working":1372,"located":1373,"csrc":1374,"directory":1375,"recompiling":1376,"entire":1377,"uv":1378,"consuming":1379,"cmake":1380,"allows":1381,"faster":1382,"iteration":1383,"necessary":1384,"components":1385,"initial":1386,"up":1387,"complements":1388,"editable":1389,"prerequisites":1390,"installed":1391,"mode":1392,"compiled":1393,"wheels":1394,"handle":1395,"subsequent":1396,"recompilations":1397,"console":1398,"venv":1399,"seed":1400,"bin":1401,"activate":1402,"vllm_use_precompiled":1403,"torch":1404,"backend":1405,"auto":1406,"toolkit":1407,"correctly":1408,"nvcc":1409,"accessible":1410,"path":1411,"relies":1412,"cuda_home":1413,"running":1414,"encounter":1415,"guides":1416,"archive":1417,"troubleshooting":1418,"cmake_cuda_compiler":1419,"variable":1420,"cmakeuserpresets":1421,"json":1422,"tools":1423,"highly":1424,"recommended":1425,"ccache":1426,"rebuilds":1427,"sudo":1428,"apt":1429,"conda":1430,"dependencies":1431,"ninja":1432,"installable":1433,"requirements":1434,"txt":1435,"package":1436,"manager":1437,"managed":1438,"settings":1439,"root":1440,"helper":1441,"simplify":1442,"provides":1443,"attempts":1444,"detect":1445,"configuration":1446,"cpu":1447,"cores":1448,"generates":1449,"clone":1450,"command":1451,"generate_cmake_presets":1452,"prompt":1453,"cannot":1454,"paths":1455,"executable":1456,"screen":1457,"prompts":1458,"existing":1459,"found":1460,"ask":1461,"confirmation":1462,"overwriting":1463,"might":1464,"look":1465,"tailor":1466,"values":1467,"input":1468,"cmakeminimumrequired":1469,"26":1470,"configurepresets":1471,"name":1472,"generator":1473,"binarydir":1474,"sourcedir":1475,"cachevariables":1476,"usr":1477,"cmake_c_compiler_launcher":1478,"cmake_cxx_compiler_launcher":1479,"cmake_cuda_compiler_launcher":1480,"cmake_build_type":1481,"vllm_python_executable":1482,"home":1483,"venvs":1484,"cmake_install_prefix":1485,"cmake_cuda_flags":1486,"nvcc_threads":1487,"cmake_job_pools":1488,"32":1489,"buildpresets":1490,"configurepreset":1491,"jobs":1492,"mean":1493,"sccache":1494,"speeds":1495,"sets":1496,"defaulting":1497,"suitable":1498,"specifies":1499,"back":1500,"crucial":1501,"makes":1502,"immediately":1503,"presets":1504,"number":1505,"detected":1506,"artifacts":1507,"building":1508,"installing":1509,"configured":1510,"initialize":1511,"configures":1512,"according":1513,"chosen":1514,"preset":1515,"creates":1516,"compiles":1517,"installs":1518,"resulting":1519,"binaries":1520,"making":1521,"target":1522,"repeat":1523,"again":1524,"update":1525,"simply":1526,"files":1527,"verifying":1528,"successful":1529,"populated":1530,"ls":1531,"cmake_install":1532,"_deps":1533,"machete_generation":1534,"log":1535,"cpackconfig":1536,"detect_cuda_compute_capabilities":1537,"cu":1538,"marlin_generation":1539,"_c":1540,"abi3":1541,"cpacksourceconfig":1542,"detect_cuda_version":1543,"cc":1544,"_moe_c":1545,"cmakecache":1546,"ctest":1547,"_flashmla_c":1548,"moe_marlin_generation":1549,"cmakefiles":1550,"cumem_allocator":1551,"install_local_manifest":1552,"flash":1553,"attn":1554,"copies":1555,"libraries":1556,"updates":1557,"tips":1558,"adjust":1559,"fine":1560,"tune":1561,"too":1562,"many":1563,"overload":1564,"ram":1565,"leading":1566,"slower":1567,"instability":1568,"won":1569,"fully":1570,"utilize":1571,"persistent":1572,"strange":1573,"especially":1574,"switching":1575,"branches":1576,"consider":1577,"removing":1578,"rm":1579,"rf":1580,"re":1581,"commands":1582,"even":1583,"iterations":1584,"module":1585,"sometimes":1586,"though":1587,"ensures":1588,"updated":1589,"profiling":1590,"intended":1591,"developers":1592,"maintainers":1593,"understand":1594,"proportion":1595,"spent":1596,"parts":1597,"codebase":1598,"turn":1599,"slow":1600,"down":1601,"profile":1602,"profiler":1603,"tracing":1604,"workers":1605,"enable":1606,"vllm_torch_profiler_dir":1607,"want":1608,"save":1609,"traces":1610,"mnt":1611,"additionally":1612,"content":1613,"specifying":1614,"variables":1615,"vllm_torch_profiler_record_shapes":1616,"off":1617,"vllm_torch_profiler_with_profile_memory":1618,"record":1619,"vllm_torch_profiler_with_stack":1620,"stack":1621,"vllm_torch_profiler_with_flops":1622,"flops":1623,"needs":1624,"bench":1625,"passing":1626,"flag":1627,"visualized":1628,"ui":1629,"perfetto":1630,"dev":1631,"tip":1632,"directly":1633,"call":1634,"entrypoints":1635,"cli":1636,"quite":1637,"untar":1638,"viewed":1639,"stop":1640,"flushes":1641,"trace":1642,"takes":1643,"100":1644,"worth":1645,"70b":1646,"minutes":1647,"flush":1648,"env":1649,"vllm_rpc_timeout":1650,"big":1651,"say":1652,"export":1653,"1800000":1654,"gh":1655,"offline_inference":1656,"simple_profiling":1657,"vllm_profile":1658,"api_server":1659,"dataset":1660,"sharegpt":1661,"num":1662,"nsight":1663,"tool":1664,"exposes":1665,"register":1666,"annotated":1667,"regions":1668,"apis":1669,"events":1670,"installationguide":1671,"block":1672,"ubuntu":1673,"recommends":1674,"gnupg":1675,"echo":1676,"deb":1677,"http":1678,"download":1679,"devtools":1680,"repos":1681,"lsb":1682,"distrib_release":1683,"tr":1684,"dpkg":1685,"print":1686,"architecture":1687,"tee":1688,"sources":1689,"adv":1690,"fetch":1691,"keys":1692,"ubuntu1804":1693,"x86_64":1694,"7fa2af80":1695,"pub":1696,"basic":1697,"append":1698,"nsys":1699,"rep":1700,"exec":1701,"8b":1702,"instruct":1703,"iters":1704,"warmup":1705,"batch":1706,"len":1707,"512":1708,"prepend":1709,"however":1710,"specify":1711,"delay":1712,"xx":1713,"duration":1714,"yy":1715,"been":1716,"killed":1717,"client":1718,"random":1719,"1024":1720,"practice":1721,"argument":1722,"whenever":1723,"sessions":1724,"session":1725,"xxxxx":1726,"manually":1727,"kill":1728,"analysis":1729,"profiles":1730,"summaries":1731,"stats":1732,"gui":1733,"locally":1734,"directions":1735,"report1":1736,"cuda_gpu_kern_sum":1737,"total":1738,"ns":1739,"avg":1740,"med":1741,"min":1742,"max":1743,"stddev":1744,"46":1745,"327":1746,"352":1747,"338":1748,"505":1749,"589":1750,"965":1751,"144":1752,"383":1753,"040":1754,"126":1755,"460":1756,"944":1757,"263":1758,"sm90_xmma_gemm_bf16bf16_bf16f32_f32_tn_n_tilesize128x128x64_warpgroupsize1x1x1_execute_segment_k_of":1759,"305":1760,"114":1761,"764":1762,"152":1763,"641":1764,"520":1765,"293":1766,"408":1767,"287":1768,"296":1769,"822":1770,"716":1771,"867":1772,"124":1773,"sm90_xmma_gemm_bf16bf16_bf16f32_f32_tn_n_tilesize256x128x64_warpgroupsize2x1x1_execute_segment_k_of":1774,"692":1775,"284":1776,"876":1777,"280":1778,"188":1779,"535":1780,"83":1781,"904":1782,"328":1783,"862":1784,"237":1785,"497":1786,"999":1787,"sm90_xmma_gemm_bf16bf16_bf16f32_f32_tn_n_tilesize64x128x64_warpgroupsize1x1x1_execute_segment_k_off":1788,"116":1789,"600":1790,"578":1791,"33":1792,"920":1793,"62":1794,"399":1795,"504":1796,"326":1797,"532":1798,"285":1799,"290":1800,"954":1801,"sm90_xmma_gemm_bf16bf16_bf16f32_f32_tn_n_tilesize64x64x64_warpgroupsize1x1x1_execute_segment_k_off_":1802,"119":1803,"749":1804,"165":1805,"912":1806,"59":1807,"208":1808,"056":1809,"784":1810,"366":1811,"271":1812,"581":1813,"void":1814,"act_and_mul_kernel":1815,"c10":1816,"bfloat16":1817,"silu_kernel":1818,"bool":1819,"t1":1820,"cons":1821,"916":1822,"662":1823,"515":1824,"312":1825,"43":1826,"011":1827,"776":1828,"928":1829,"586":1830,"205":1831,"199":1832,"790":1833,"device_kernel":1834,"enable_sm90_or_later":1835,"flashattnfwdsm90":1836,"collectivema":1837,"587":1838,"283":1839,"113":1840,"37":1841,"824":1842,"526":1843,"008":1844,"719":1845,"517":1846,"756":1847,"139":1848,"091":1849,"std":1850,"enable_if":1851,"t2":1852,"int":1853,"_typeconvert":1854,"exists":1855,"fused_add_rms_norm_kern":1856,"418":1857,"362":1858,"605":1859,"121":1860,"871":1861,"523":1862,"870":1863,"175":1864,"248":1865,"rotary_embedding_kernel":1866,"const":1867,"long":1868,"167":1869,"083":1870,"069":1871,"880":1872,"849":1873,"240":1874,"471":1875,"499":1876,"996":1877,"101":1878,"436":1879,"reshape_and_cache_flash_kernel":1880,"__nv_bfloat16":1881,"fp8kvcachedatatype":1882,"1799":1883,"screenshot":1884,"48":1885,"42":1886,"am":1887,"attachments":1888,"c7cff1ae":1889,"6d6f":1890,"477d":1891,"a342":1892,"bd13c4fc424c":1893,"standard":1894,"cprofile":1895,"couple":1896,"helpers":1897,"section":1898,"utils":1899,"cprofile_context":1900,"functions":1901,"decorator":1902,"function":1903,"filename":1904,"saved":1905,"printed":1906,"stdout":1907,"expensive_function":1908,"prof":1909,"def":1910,"expensive":1911,"context":1912,"another_function":1913,"analyzing":1914,"help":1915,"analyze":1916,"snakeviz":1917,"jiffyclub":1918,"deprecation":1919,"outlines":1920,"deprecating":1921,"structured":1922,"lifecycle":1923,"deprecated":1924,"given":1925,"notice":1926,"deprecations":1927,"proceed":1928,"predictable":1929,"manner":1930,"aim":1931,"strike":1932,"balance":1933,"innovation":1934,"respecting":1935,"reliance":1936,"functionality":1937,"tied":1938,"semantic":1939,"rare":1940,"removals":1941,"safer":1942,"enhancements":1943,"fall":1944,"minimum":1945,"flags":1946,"consists":1947,"several":1948,"clearly":1949,"defined":1950,"stages":1951,"still":1952,"marked":1953,"timeline":1954,"removal":1955,"explicitly":1956,"stated":1957,"removed":1958,"noted":1959,"applicable":1960,"strings":1961,"responses":1962,"metrics":1963,"facing":1964,"typing_extensions":1965,"disabled":1966,"enabled":1967,"throws":1968,"error":1969,"enabling":1970,"missed":1971,"earlier":1972,"warnings":1973,"escape":1974,"hatch":1975,"signaling":1976,"imminent":1977,"surfaced":1978,"blocks":1979,"breakage":1980,"completely":1981,"listed":1982,"legacy":1983,"important":1984,"disallowed":1985,"avoid":1986,"surprising":1987,"grace":1988,"its":1989,"retroactively":1990,"stage":1991,"documented":1992,"living":1993,"evolve":1994,"encouraged":1995,"refine":1996,"suites":1997,"two":1998,"nightly":1999,"confirm":2000,"whether":2001,"improve":2002,"workloads":2003,"perf":2004,"ready":2005,"labels":2006,"buildkite":2007,"descriptions":2008,"alternatives":2009,"tgi":2010,"trt":2011,"lmdeploy":2012,"bumping":2013,"primarily":2014,"consumers":2015,"evaluate":2016,"choose":2017,"over":2018,"options":2019,"posts":2020,"interest":2021,"kinds":2022,"matter":2023,"small":2024,"identify":2025,"bugs":2026,"suggest":2027,"implement":2028,"believe":2029,"thus":2030,"answering":2031,"queries":2032,"offering":2033,"reviews":2034,"assisting":2035,"regarded":2036,"finally":2037,"impactful":2038,"raising":2039,"awareness":2040,"highlight":2041,"driving":2042,"incredible":2043,"projects":2044,"appreciation":2045,"starring":2046,"job":2047,"board":2048,"unsure":2049,"links":2050,"tasks":2051,"good":2052,"3aissue":2053,"20state":2054,"3aopen":2055,"20label":2056,"3a":2057,"22good":2058,"20first":2059,"20issue":2060,"selected":2061,"onboarding":2062,"22new":2063,"capabilities":2064,"license":2065,"developing":2066,"python_env_setup":2067,"inc":2068,"depending":2069,"iterating":2070,"incremental_build":2071,"mkdocs":2072,"simple":2073,"downright":2074,"gorgeous":2075,"static":2076,"site":2077,"geared":2078,"towards":2079,"yaml":2080,"plugins":2081,"along":2082,"awesome":2083,"nav":2084,"requires":2085,"opt":2086,"miniconda3":2087,"envs":2088,"mkdoc":2089,"lib":2090,"python3":2091,"packages":2092,"git":2093,"cd":2094,"lets":2095,"preview":2096,"sure":2097,"106":2098,"seconds":2099,"watching":2100,"127":2101,"8000":2102,"browser":2103,"platforms":2104,"linting":2105,"formatting":2106,"checking":2107,"diff":2108,"failure":2109,"mypy":2110,"hook":2111,"unit":2112,"tests":2113,"pytest":2114,"detailed":2115,"test_logger":2116,"docker":2117,"dockerfile":2118,"ships":2119,"except":2120,"therefore":2121,"minimise":2122,"chance":2123,"clashing":2124,"missing":2125,"fails":2126,"checked":2127,"don":2128,"platform":2129,"rely":2130,"already":2131,"much":2132,"relevant":2133,"possible":2134,"discover":2135,"instructions":2136,"pull":2137,"contribution":2138,"submitting":2139,"meets":2140,"helps":2141,"maintain":2142,"quality":2143,"efficiency":2144,"dco":2145,"signed":2146,"agree":2147,"header":2148,"certifies":2149,"agreement":2150,"automatic":2151,"sign":2152,"ide":2153,"pycharm":2154,"click":2155,"window":2156,"bring":2157,"modify":2158,"vscode":2159,"editor":2160,"visualstudio":2161,"alwayssignoff":2162,"field":2163,"classification":2164,"types":2165,"prefixed":2166,"appropriately":2167,"indicate":2168,"bugfix":2169,"doc":2170,"improving":2171,"appear":2172,"frontend":2173,"affecting":2174,"logic":2175,"llmengine":2176,"asyncllmengine":2177,"misc":2178,"fit":2179,"sparingly":2180,"spans":2181,"category":2182,"prefixes":2183,"meet":2184,"adhere":2185,"styleguide":2186,"pyguide":2187,"cppguide":2188,"linter":2189,"checks":2190,"easily":2191,"stays":2192,"correct":2193,"robust":2194,"modifies":2195,"behaviors":2196,"changing":2197,"actively":2198,"modifying":2199,"custom":2200,"schema":2201,"implementations":2202,"registered":2203,"operators":2204,"tutorials":2205,"cpp_custom_ops":2206,"cpp":2207,"tutorial":2208,"1_w62p8wjoqquzpsjya7s701jxt0qf2oflub2sbkhoau":2209,"return":2210,"tensors":2211,"dynamic":2212,"dims":2213,"handled":2214,"documents":2215,"description":2216,"opcheck":2217,"registration":2218,"signature":2219,"op":2220,"reflect":2221,"pt2":2222,"18fbmpuoj0fy5zq6yyrhuppw9fa332cpntgb6soigyua":2223,"concise":2224,"500":2225,"loc":2226,"excluding":2227,"config":2228,"expect":2229,"design":2230,"justification":2231,"go":2232,"goal":2233,"transparent":2234,"reviewing":2235,"machine":2236,"feels":2237,"confused":2238,"frustrated":2239,"prioritize":2240,"submitted":2241,"assigned":2242,"reviewer":2243,"expertise":2244,"ping":2245,"put":2246,"respond":2247,"reasonable":2248,"frame":2249,"comment":2250,"isn":2251,"disagree":2252,"suggestion":2253,"clarification":2254,"executed":2255,"due":2256,"computational":2257,"merge":2258,"read":2259,"great":2260,"mentioned":2261,"vmt":2262,"managing":2263,"triaging":2264,"reporters":2265,"resolution":2266,"drafting":2267,"confirmed":2268,"coordination":2269,"fix":2270,"published":2271,"prefer":2272,"related":2273,"urgent":2274,"simon":2275,"mo":2276,"hey":2277,"russell":2278,"bryant":2279,"rbryant":2280,"redhat":2281,"huzaifa":2282,"sidhpurwala":2283,"huzaifas":2284,"discussion":2285,"topics":2286,"disclose":2287,"member":2288,"disclosure":2289,"disclosing":2290,"develop":2291,"coordinate":2292,"prepare":2293,"adequately":2294,"publish":2295,"reference":2296,"minimize":2297,"amount":2298,"construct":2299,"image":2300,"deploying":2301,"visual":2302,"representation":2303,"nodes":2304,"highlighted":2305,"grey":2306,"images":2307,"dashed":2308,"borders":2309,"edges":2310,"represent":2311,"solid":2312,"line":2313,"arrow":2314,"head":2315,"copy":2316,"empty":2317,"mount":2318,"dotted":2319,"diamond":2320,"dependency":2321,"query":2322,"patrickhoefler":2323,"dockerfilegraph":2324,"regenerate":2325,"present":2326,"legend":2327,"dpi":2328,"200":2329,"length":2330,"50":2331,"workdir":2332,"workspace":2333,"volume":2334,"pwd":2335,"ghcr":2336,"alpine":2337,"failures":2338,"my":2339,"think":2340,"caused":2341,"orgs":2342,"likely":2343,"unrelated":2344,"fixing":2345,"leave":2346,"react":2347,"signal":2348,"filing":2349,"450":2350,"failing":2351,"regex":2352,"matching":2353,"abcdef123":2354,"failed":2355,"failing_test1":2356,"failing_test2":2357,"400":2358,"failing_test3":2359,"attach":2360,"logs":2361,"collapsible":2362,"38":2363,"dump_input":2364,"68":2365,"dumping":2366,"traceback":2367,"last":2368,"dist":2369,"engine":2370,"203":2371,"execute_model":2372,"self":2373,"model_executor":2374,"scheduler_output":2375,"wrangling":2376,"strip":2377,"timestamps":2378,"colorization":2379,"scripts":2380,"sh":2381,"wl":2382,"clipboard":2383,"bugaevc":2384,"quick":2385,"pasting":2386,"tail":2387,"525":2388,"ci_build":2389,"investigating":2390,"bisect":2391,"shows":2392,"findings":2393,"candidate":2394,"mention":2395,"reproducing":2396,"flaky":2397,"repeatedly":2398,"rerun":2399,"test_engine_core_client":2400,"test_kv_cache_events":2401,"tcp":2402,"submit":2403,"link":2404,"closes":2405,"12345":2406,"reliability":2407,"analytics":2408,"asc":2409,"sort_by":2410,"runs":2411,"daily":2412,"2days":2413,"exclude":2414,"legitimate":2415,"ignore":2416,"oss":2417,"early":2418,"trivial":2419,"gap":2420,"16859":2421,"steps":2422,"achieve":2423,"candidates":2424,"updating":2425,"ideal":2426,"discovered":2427,"resolved":2428,"waiting":2429,"next":2430,"implementing":2431,"hacky":2432,"workarounds":2433,"better":2434,"solution":2435,"downloaded":2436,"whl":2437,"torch2":2438,"cu12":2439,"torchvision":2440,"torchaudio":2441,"url":2442,"cu128":2443,"announced":2444,"announcements":2445,"begin":2446,"option":2447,"rocm6":2448,"extra":2449,"strategy":2450,"uv_index_strategy":2451,"unsafe":2452,"raise":2453,"initiate":2454,"experimental":2455,"limitations":2456,"cu126":2457,"uploaded":2458,"blackwell":2459,"complicates":2460,"box":2461,"dockerfiles":2462,"indexes":2463,"moment":2464,"xpu":2465,"tested":2466,"upload":2467,"cache":2468,"exist":2469,"s3":2470,"bucket":2471,"causing":2472,"potentially":2473,"hours":2474,"timeout":2475,"fastcheck":2476,"doesn":2477,"populate":2478,"warm":2479,"ineffective":2480,"ongoing":2481,"efforts":2482,"17419":2483,"workaround":2484,"vllm_ci_branch":2485,"khluu":2486,"use_postmerge_q":2487,"triggering":2488,"accomplishes":2489,"things":2490,"increase":2491,"limit":2492,"a8ff0fcd":2493,"76e0":2494,"4e91":2495,"b72f":2496,"014e3fdb6b94":2497,"depend":2498,"accordingly":2499,"rather":2500,"unblock":2501,"27bebcd89792d5c4b08af7a65095759526f2f9e1":2502,"l259":2503,"l271":2504,"torch_cuda_arch_list":2505,"ptx":2506,"flashinfer_enable_sm90":2507,"isolation":2508,"caveat":2509,"adds":2510,"approximately":2511,"preferable":2512,"location":2513,"immediate":2514,"flashinfer_python":2515,"2bcu128torch2":2516,"cp39":2517,"linux_x86_64":2518,"xformers":2519,"max_jobs":2520,"facebookresearch":2521,"attempting":2522,"manageable":2523,"separately":2524,"separation":2525,"selectively":2526,"instance":2527,"extension":2528,"17444":2529,"completed":2530,"walks":2531,"modeling_opt":2532,"transformers":2533,"original":2534,"copyright":2535,"licensing":2536,"initialization":2537,"modules":2538,"constructor":2539,"dictionary":2540,"names":2541,"operator":2542,"unique":2543,"layer":2544,"conflicts":2545,"uniform":2546,"checkpoint":2547,"quantize":2548,"layers":2549,"keeping":2550,"initialized":2551,"nn":2552,"vllmconfig":2553,"myattention":2554,"__init__":2555,"vllm_config":2556,"str":2557,"super":2558,"mydecoderlayer":2559,"self_attn":2560,"mymodel":2561,"modulelist":2562,"range":2563,"model_config":2564,"hf_config":2565,"num_hidden_layers":2566,"mymodelforcausallm":2567,"get_input_embeddings":2568,"method":2569,"inside":2570,"returns":2571,"embeddings":2572,"input_ids":2573,"equivalent":2574,"unified":2575,"interface":2576,"composite":2577,"rewrite":2578,"forward":2579,"unnecessary":2580,"training":2581,"treat":2582,"positions":2583,"flattened":2584,"dimension":2585,"sequence":2586,"intermediate_tensors":2587,"intermediatetensors":2588,"none":2589,"inputs_embeds":2590,"mechanism":2591,"variant":2592,"rotary":2593,"positional":2594,"employs":2595,"implementation":2596,"yours":2597,"adapt":2598,"dir":2599,"manage":2600,"substitute":2601,"replace":2602,"vocabparallelembedding":2603,"lm":2604,"parallellmhead":2605,"parallelize":2606,"replicatedlinear":2607,"replicates":2608,"inputs":2609,"across":2610,"saving":2611,"rowparallellinear":2612,"partitioned":2613,"hidden":2614,"rows":2615,"multiplication":2616,"ffn":2617,"transformation":2618,"columnparallellinear":2619,"replicated":2620,"columns":2621,"result":2622,"separated":2623,"qkv":2624,"mergedcolumnparallellinear":2625,"merges":2626,"weighted":2627,"silu":2628,"handles":2629,"sharded":2630,"qkvparallellinear":2631,"projections":2632,"grouped":2633,"mechanisms":2634,"heads":2635,"world":2636,"properly":2637,"replication":2638,"linear_method":2639,"schemes":2640,"load_weights":2641,"forcausallm":2642,"load":2643,"assign":2644,"specifically":2645,"page":2646,"frequently":2647,"asked":2648,"interleaving":2649,"sliding":2650,"windows":2651,"gemma":2652,"2b":2653,"mistralai":2654,"ministral":2655,"2410":2656,"kv":2657,"tokens":2658,"dropped":2659,"appears":2660,"care":2661,"layer_types":2662,"modeling":2663,"parse":2664,"per_layer_sliding_window":2665,"996357e4808ca5eab97d4c97c7d25b3073f46aab":2666,"l171":2667,"interleave":2668,"explains":2669,"fail":2670,"registry":2671,"dummy":2672,"maintained":2673,"hf":2674,"min_transformers_version":2675,"skip":2676,"until":2677,"confidence":2678,"correctness":2679,"subdirectories":2680,"generative":2681,"generative_models":2682,"levels":2683,"exact":2684,"check_outputs_equal":2685,"outputted":2686,"exactly":2687,"logprobs":2688,"similarity":2689,"check_logprobs_close":2690,"top":2691,"vice":2692,"versa":2693,"pooling":2694,"pooling_models":2695,"cosine":2696,"mm":2697,"processing":2698,"test_common":2699,"verifies":2700,"cached":2701,"processor":2702,"accepts":2703,"keyword":2704,"arguments":2705,"test_phi3v":2706,"decoder":2707,"loaded":2708,"having":2709,"specialized":2710,"advantage":2711,"compatibility_matrix":2712,"optimize":2713,"complexity":2714,"integrating":2715,"heavily":2716,"considerably":2717,"straightforward":2718,"shares":2719,"complex":2720,"pages":2721,"registering":2722,"encountering":2723,"happy":2724,"extend":2725,"multimodal_inputs":2726,"assumed":2727,"get_placeholder_str":2728,"interfaces":2729,"supportsmultimodal":2730,"placeholder":2731,"string":2732,"item":2733,"yourmodelforimage2seq":2734,"classmethod":2735,"cls":2736,"modality":2737,"startswith":2738,"valueerror":2739,"reserve":2740,"corresponds":2741,"shown":2742,"pixel_values":2743,"sampleroutput":2744,"kwargs":2745,"retrieve":2746,"get_multimodal_embeddings":2747,"tokenizer":2748,"boilerplate":2749,"typical":2750,"own":2751,"_process_image_input":2752,"image_input":2753,"yourmodelimageinputs":2754,"assert":2755,"vision_encoder":2756,"image_features":2757,"multi_modal_projector":2758,"object":2759,"multimodalembeddings":2760,"validate":2761,"_parse_and_validate_image_input":2762,"encoder":2763,"projector":2764,"vision_embeddings":2765,"returned":2766,"multimodal_embeddings":2767,"3d":2768,"shape":2769,"num_items":2770,"feature_size":2771,"hidden_size":2772,"tuple":2773,"2d":2774,"retrieves":2775,"th":2776,"sections":2777,"leverage":2778,"utility":2779,"merge_multimodal_embeddings":2780,"language_model":2781,"placeholder_token_id":2782,"image_token_index":2783,"get_language_model":2784,"getter":2785,"done":2786,"named":2787,"co":2788,"model_doc":2789,"create":2790,"subclass":2791,"baseprocessinginfo":2792,"maximum":2793,"items":2794,"override":2795,"abstract":2796,"get_supported_mm_limits":2797,"video":2798,"mapping":2799,"inherit":2800,"basedummyinputsbuilder":2801,"methods":2802,"get_dummy_text":2803,"get_dummy_mm_data":2804,"worst":2805,"increases":2806,"constructed":2807,"maximize":2808,"llavaforconditionalgeneration":2809,"v4":2810,"47":2811,"modeling_llava":2812,"l530":2813,"l544":2814,"n_image_tokens":2815,"sum":2816,"n_image_features":2817,"special_image_mask":2818,"unsqueeze":2819,"expand_as":2820,"device":2821,"masked_scatter":2822,"calculated":2823,"get_image_features":2824,"l290":2825,"l300":2826,"image_outputs":2827,"vision_tower":2828,"output_hidden_states":2829,"selected_image_feature":2830,"hidden_states":2831,"vision_feature_layer":2832,"vision_feature_select_strategy":2833,"elif":2834,"else":2835,"unexpected":2836,"select":2837,"infer":2838,"vision":2839,"tower":2840,"clipvisionmodel":2841,"7b":2842,"moreover":2843,"determined":2844,"states":2845,"clipvisiontransformer":2846,"clip":2847,"modeling_clip":2848,"l1094":2849,"l1102":2850,"interpolate_pos_encoding":2851,"pre_layrnorm":2852,"encoder_outputs":2853,"output_attentions":2854,"return_dict":2855,"clipvisionembeddings":2856,"l247":2857,"l257":2858,"target_dtype":2859,"patch_embedding":2860,"patch_embeds":2861,"grid":2862,"flatten":2863,"transpose":2864,"class_embeds":2865,"class_embedding":2866,"expand":2867,"batch_size":2868,"cat":2869,"dim":2870,"height":2871,"position_embedding":2872,"position_ids":2873,"num_positions":2874,"l195":2875,"l196":2876,"num_patches":2877,"image_size":2878,"patch_size":2879,"get_num_image_tokens":2880,"image_width":2881,"image_height":2882,"get_hf_config":2883,"hf_processor":2884,"get_hf_processor":2885,"vision_config":2886,"num_image_tokens":2887,"actuality":2888,"usually":2889,"part":2890,"simplicity":2891,"get_image_size_with_most_features":2892,"imagesize":2893,"seq_len":2894,"mm_counts":2895,"multimodaldatadict":2896,"num_images":2897,"target_width":2898,"target_height":2899,"_get_dummy_images":2900,"desired":2901,"image_token":2902,"placeholders":2903,"fuyu":2904,"fuyuforcausallm":2905,"modeling_fuyu":2906,"l311":2907,"l322":2908,"image_patches":2909,"past_key_values":2910,"patch_embeddings":2911,"vision_embed_tokens":2912,"squeeze":2913,"gather_continuous_embeddings":2914,"word_embeddings":2915,"continuous_embeddings":2916,"image_patch_input_indices":2917,"image_patches_indices":2918,"num_total_patches":2919,"unlike":2920,"patches":2921,"considering":2922,"fuyuprocessor":2923,"let":2924,"preprocessing":2925,"obtained":2926,"fuyuimageprocessor":2927,"preprocess":2928,"preprocess_with_tokenizer_info":2929,"resized":2930,"padded":2931,"returning":2932,"resizing":2933,"padding":2934,"metadata":2935,"processing_fuyu":2936,"l541":2937,"image_encoding":2938,"image_processor":2939,"output_kwargs":2940,"images_kwargs":2941,"batch_images":2942,"image_unpadded_heights":2943,"image_unpadded_widths":2944,"image_processing_fuyu":2945,"l480":2946,"do_resize":2947,"resize":2948,"input_data_format":2949,"image_sizes":2950,"get_image_size":2951,"channel_dim":2952,"do_pad":2953,"pad_image":2954,"padding_mode":2955,"constant_values":2956,"padding_value":2957,"split":2958,"l417":2959,"l425":2960,"model_image_input":2961,"tensor_batch_images":2962,"image_present":2963,"image_unpadded_h":2964,"image_unpadded_w":2965,"image_placeholder_id":2966,"image_newline_id":2967,"variable_sized":2968,"l638":2969,"l658":2970,"new_h":2971,"ceil":2972,"batch_index":2973,"subseq_index":2974,"patch_height":2975,"new_w":2976,"patch_width":2977,"get_num_patches":2978,"tensor_of_image_ids":2979,"int32":2980,"patchify_image":2981,"l552":2982,"l562":2983,"divisible":2984,"num_patches_per_dim_h":2985,"num_patches_per_dim_w":2986,"correspond":2987,"speaker":2988,"inputting":2989,"get_image_processor":2990,"very":2991,"afterwards":2992,"basemultimodalprocessor":2993,"fill":2994,"mm_processing":2995,"fields":2996,"_get_mm_fields_config":2997,"clipimageprocessor":2998,"num_channels":2999,"image_processing_clip":3000,"l339":3001,"l345":3002,"to_channel_dimension_format":3003,"data_format":3004,"input_channel_dim":3005,"all_images":3006,"batchfeature":3007,"tensor_type":3008,"return_tensors":3009,"hf_inputs":3010,"hf_processor_mm_kwargs":3011,"multimodalfieldconfig":3012,"dict":3013,"batched":3014,"actual":3015,"computed":3016,"image_embeds":3017,"postprocessing":3018,"concatenates":3019,"belonging":3020,"l673":3021,"l679":3022,"image_input_ids":3023,"batch_image_input_ids":3024,"batch_image_patches":3025,"overriding":3026,"_call_hf_processor":3027,"mm_data":3028,"mm_kwargs":3029,"tok_kwargs":3030,"processed_outputs":3031,"isinstance":3032,"pn":3033,"px":3034,"handling":3035,"prevent":3036,"whereas":3037,"_get_prompt_updates":3038,"promptupdate":3039,"insertion":3040,"replacement":3041,"llavaprocessor":3042,"processing_llava":3043,"l167":3044,"l170":3045,"prompt_strings":3046,"sample":3047,"repeats":3048,"mm_items":3049,"multimodaldataitems":3050,"out_mm_kwargs":3051,"multimodalkwargs":3052,"image_token_id":3053,"get_replacement":3054,"item_idx":3055,"get_items":3056,"imageprocessoritems":3057,"promptreplacement":3058,"recall":3059,"layout":3060,"newline":3061,"ncols":3062,"nrows":3063,"get_image_feature_grid_size":3064,"height_scale_factor":3065,"width_scale_factor":3066,"optimal_scale_factor":3067,"initially":3068,"_image_token_id":3069,"_newline_token_id":3070,"entirely":3071,"called":3072,"bos":3073,"promopt":3074,"l435":3075,"prompt_tokens":3076,"prompts_length":3077,"_tokenize_prompts_with_image_and_batch":3078,"scale_factors":3079,"max_tokens_to_generate":3080,"max_position_embeddings":3081,"add_bos":3082,"add_beginning_of_answer_token":3083,"promptupdatedetails":3084,"bos_token_id":3085,"get_replacement_fuyu":3086,"image_tokens":3087,"select_token_id":3088,"embed_token_id":3089,"noticing":3090,"removes":3091,"endoftext":3092,"tokenized":3093,"get_tokenizer":3094,"eot_token_id":3095,"decorate":3096,"multimodal_registry":3097,"register_processor":3098,"multimodalregistry":3099,"yourmultimodalprocessor":3100,"yourprocessinginfo":3101,"dummy_inputs":3102,"yourdummyinputsbuilder":3103,"inserting":3104,"processors":3105,"insert":3106,"replacing":3107,"anything":3108,"promptinsertion":3109,"blip":3110,"blip2":3111,"florence2":3112,"molmo":3113,"assumes":3114,"application":3115,"_apply_hf_processor_tokens_only":3116,"processed":3117,"applying":3118,"bypass":3119,"chameleon":3120,"appends":3121,"sep_token":3122,"boa_token":3123,"elsewhere":3124,"hub":3125,"vl2":3126,"deepseek_vl2":3127,"internvl":3128,"qwen":3129,"vl":3130,"qwen_vl":3131,"forking":3132,"gives":3133,"ability":3134,"_vllm_models":3135,"upon":3136,"importing":3137,"promote":3138,"plugin":3139,"plugin_system":3140,"entrypoint":3141,"modelregistry":3142,"your_code":3143,"yourmodelforcausallm":3144,"register_model":3145,"imports":3146,"lazy":3147,"runtimeerror":3148,"subprocess":3149,"implements":3150,"tuning":3151,"covers":3152,"strategies":3153,"consult":3154,"conserving_memory":3155,"conserve":3156,"preemption":3157,"regressive":3158,"space":3159,"insufficient":3160,"preempt":3161,"preempted":3162,"recomputed":3163,"occurs":3164,"00":3165,"49":3166,"1057":3167,"preemptionmode":3168,"recompute":3169,"enough":3170,"gpu_memory_utilization":3171,"tensor_parallel_size":3172,"total_cumulative_preemption_cnt":3173,"robustness":3174,"recomputation":3175,"adversely":3176,"preemptions":3177,"allocates":3178,"percentage":3179,"increasing":3180,"utilization":3181,