{"readme":0,"md":1,"clang":2,"format":3,"use_existing_torch":4,"py":5,"yapfignore":6,"gitignore":7,"sh":8,"pre":9,"commit":10,"config":11,"yaml":12,"dockerignore":13,"security":14,"shellcheckrc":15,"pyproject":16,"toml":17,"manifest":18,"cmakelists":19,"txt":20,"release":21,"readthedocs":22,"mkdocs":23,"contributing":24,"code_of_conduct":25,"license":26,"dco":27,"find_cuda_init":28,"markdownlint":29,"setup":30,"nav":31,"yml":32,"quickstart":33,"device":34,"template":35,"gpu":36,"python_env_setup":37,"inc":38,"google_tpu":39,"intel_gaudi":40,"cpu":41,"aws_neuron":42,"x86":43,"s390x":44,"apple":45,"arm":46,"build":47,"cuda":48,"xpu":49,"rocm":50,"v1_guide":51,"troubleshooting":52,"faq":53,"reproducibility":54,"usage_stats":55,"metrics":56,"run":57,"batch":58,"complete":59,"json_tip":60,"serve":61,"meta":62,"chat":63,"throughput":64,"latency":65,"rlhf":66,"trl":67,"sponsors":68,"meetups":69,"contact_us":70,"docker":71,"k8s":72,"nginx":73,"haystack":74,"open":75,"webui":76,"modal":77,"autogen":78,"dify":79,"lobe":80,"dstack":81,"retrieval_augmented_generation":82,"lws":83,"cerebrium":84,"bentoml":85,"litellm":86,"anyscale":87,"skypilot":88,"triton":89,"streamlit":90,"helm":91,"anything":92,"llm":93,"chatbox":94,"kubeai":95,"llamastack":96,"kuberay":97,"llmaz":98,"production":99,"stack":100,"kserve":101,"tpu":102,"conserving_memory":103,"env_vars":104,"engine_args":105,"model_resolution":106,"optimization":107,"serve_args":108,"settings":109,"png":110,"open_webui":111,"architecture_helm_deployment":112,"create":113,"chatbot":114,"dp_external_lb":115,"provider":116,"without":117,"doc":118,"upload":119,"dp_internal_lb":120,"dockerfile":121,"stages":122,"dependency":123,"vllm":124,"logo":125,"only":126,"light":127,"text":128,"ico":129,"dark":130,"hierarchy":131,"intervals":132,"llm_engine":133,"excalidraw":134,"entrypoints":135,"prepare_and_finalize_blocks":136,"fused_moe_non_batched":137,"fused_experts_blocks":138,"fused_moe_batched":139,"free":140,"example":141,"time":142,"overview":143,"k_vecs":144,"v_vec":145,"key":146,"value":147,"q_vecs":148,"query":149,"logits_vec":150,"most_model_len":151,"abstraction":152,"jpg":153,"workflow":154,"high_level_design":155,"benchmarks":156,"vulnerability_management":157,"deprecation_policy":158,"profiling":159,"incremental_build":160,"tests":161,"multimodal":162,"basic":163,"registration":164,"failures":165,"update_pytorch_version":166,"supported_models":167,"pooling_models":168,"generative_models":169,"tensorizer":170,"runai_model_streamer":171,"fastsafetensor":172,"extra":173,"css":174,"edit_and_feedback":175,"js":176,"run_llm_widget":177,"slack_and_forum":178,"url_schemes":179,"remove_announcement":180,"generate_argparse":181,"generate_examples":182,"main":183,"html":184,"toc":185,"item":186,"expert_parallel_deployment":187,"data_parallel_deployment":188,"distributed_troubleshooting":189,"offline_inference":190,"parallelism_scaling":191,"openai_compatible_server":192,"llamaindex":193,"langchain":194,"arch_overview":195,"torch_compile":196,"p2p_nccl_connector":197,"plugin_system":198,"huggingface_integration":199,"paged_attention":200,"prefix_caching":201,"fused_moe_modular_kernel":202,"mm_processing":203,"multiprocessing":204,"prompt_embeds":205,"compatibility_matrix":206,"lora":207,"automatic_prefix_caching":208,"tool_calling":209,"multimodal_inputs":210,"reasoning_outputs":211,"spec_decode":212,"disagg_prefill":213,"structured_outputs":214,"sleep_mode":215,"quantized_kvcache":216,"torchao":217,"int4":218,"gptqmodel":219,"bnb":220,"bitblas":221,"gguf":222,"modelopt":223,"fp8":224,"quark":225,"auto_round":226,"auto_awq":227,"int8":228,"supported_hardware":229,"_custom_ops":230,"scripts":231,"outputs":232,"collect_env":233,"envs":234,"_ipex_ops":235,"version":236,"sampling_params":237,"test_utils":238,"forward_context":239,"logger":240,"tasks":241,"connections":242,"env_override":243,"typed":244,"beam_search":245,"__init__":246,"logits_process":247,"sequence":248,"scalar_type":249,"pooling_params":250,"tracing":251,"usage_lib":252,"cumem":253,"score_utils":254,"chat_utils":255,"utils":256,"tool":257,"launcher":258,"tool_server":259,"context":260,"ssl":261,"harmony_utils":262,"api_server":263,"run_batch":264,"openai":265,"types":266,"base":267,"serving_pooling":268,"serving_classification":269,"serving_engine":270,"serving_tokenization":271,"protocol":272,"serving_responses":273,"serving_chat":274,"logits_processors":275,"cli_args":276,"speech_to_text":277,"serving_score":278,"serving_models":279,"serving_completion":280,"serving_embedding":281,"serving_transcription":282,"abstract_tool_parser":283,"kimi_k2_tool_parser":284,"pythonic_tool_parser":285,"glm4_moe_tool_parser":286,"phi4mini_tool_parser":287,"minimax_tool_parser":288,"internlm2_tool_parser":289,"hunyuan_a13b_tool_parser":290,"xlam_tool_parser":291,"jamba_tool_parser":292,"granite_tool_parser":293,"llama_tool_parser":294,"step3_tool_parser":295,"hermes_tool_parser":296,"qwen3coder_tool_parser":297,"llama4_pythonic_tool_parser":298,"granite_20b_fc_tool_parser":299,"mistral_tool_parser":300,"deepseekv3_tool_parser":301,"arg_utils":302,"async_llm_engine":303,"async_timeout":304,"metrics_types":305,"client":306,"engine":307,"stop_checker":308,"single_step":309,"interfaces":310,"util":311,"resolver":312,"fully_sharded_layers":313,"worker_manager":314,"request":315,"layers":316,"models":317,"peft_helper":318,"punica_selector":319,"punica_xpu":320,"punica_cpu":321,"punica_base":322,"punica_tpu":323,"punica_gpu":324,"lora_ops":325,"lora_expand_op":326,"lora_shrink_op":327,"lora_kernel_metadata":328,"kernel_utils":329,"datasets":330,"endpoint_request_func":331,"ready_checker":332,"neuronx_distributed_model_runner":333,"neuron_model_runner":334,"cache_engine":335,"worker_base":336,"neuron_worker":337,"enc_dec_model_runner":338,"pooling_model_runner":339,"worker":340,"model_runner_base":341,"model_runner":342,"gitkeep":343,"detokenizer_utils":344,"tokenizer_group":345,"detokenizer":346,"tokenizer":347,"processor":348,"s3_utils":349,"tokenizer_base":350,"dynamic_module":351,"mistral":352,"template_basic":353,"jinja":354,"registry":355,"template_fuyu":356,"template_deepseek_vl2":357,"template_blip2":358,"template_chatml":359,"jais":360,"mlp_speculator":361,"medusa":362,"kimi_vl":363,"moonvit":364,"arctic":365,"eagle":366,"nemotron":367,"chatglm":368,"falcon":369,"nemotron_vl":370,"ultravox":371,"deepseek_vl2":372,"ovis":373,"step3_vl":374,"nemotron_h":375,"algos":376,"preprocess":377,"parse":378,"data":379,"pynvml":380,"filesystem_resolver":381,"audio":382,"image":383,"video":384,"cache":385,"inputs":386,"hasher":387,"processing":388,"communication_op":389,"kv_events":390,"parallel_state":391,"tpu_distributed_utils":392,"neuron_communicator":393,"pynccl":394,"all2all":395,"custom_all_reduce":396,"custom_all_reduce_utils":397,"pynccl_wrapper":398,"cuda_communicator":399,"base_device_communicator":400,"quick_all_reduce":401,"ray_communicator":402,"cpu_communicator":403,"xpu_communicator":404,"tpu_communicator":405,"shm_broadcast":406,"cuda_wrapper":407,"disagg_prefill_workflow":408,"kv_transfer_state":409,"mooncake_pipe":410,"pynccl_pipe":411,"mooncake_store":412,"simple_buffer":413,"factory":414,"multi_connector":415,"nixl_connector":416,"lmcache_connector":417,"shared_storage_connector":418,"p2p_nccl_engine":419,"tensor_memory_pool":420,"rebalance_algo":421,"eplb_state":422,"rebalance_execute":423,"selector":424,"layer":425,"chunked_local_attention":426,"kv_sharing_utils":427,"fa_utils":428,"rocm_flash_attn":429,"dual_chunk_flash_attn":430,"abstract":431,"rocm_aiter_mla":432,"placeholder_attn":433,"triton_mla":434,"flashmla":435,"differential_flash_attn":436,"xformers":437,"flash_attn":438,"flashinfer":439,"common":440,"chunked_prefill_paged_decode":441,"nki_flash_attn":442,"triton_flash_attention":443,"rocm_aiter_paged_attn":444,"triton_unified_attention":445,"prefix_prefill":446,"triton_merge_attn_states":447,"merge_attn_states":448,"pallas_kv_cache_update":449,"paged_attn":450,"triton_decode_attention":451,"interface":452,"neuron":453,"gptoss_reasoning_parser":454,"hunyuan_a13b_reasoning_parser":455,"deepseek_r1_reasoning_parser":456,"mistral_reasoning_parser":457,"abs_reasoning_parsers":458,"granite_reasoning_parser":459,"qwen3_reasoning_parser":460,"glm4_moe_reasoning_parser":461,"step3_reasoning_parser":462,"dump_input":463,"formatter":464,"layerwise_profile":465,"kv_cache_interface":466,"cudagraph_dispatcher":467,"serial_utils":468,"stats":469,"loggers":470,"prometheus":471,"reader":472,"ray_wrappers":473,"parallel_sampling":474,"core_client":475,"output_processor":476,"mm_input_cache":477,"core":478,"async_llm":479,"logprobs":480,"coordinator":481,"exceptions":482,"gpu_model_runner":483,"xpu_model_runner":484,"cpu_worker":485,"lora_model_runner_mixin":486,"cpu_model_runner":487,"tpu_input_batch":488,"gpu_input_batch":489,"tpu_worker":490,"kv_connector_model_runner_mixin":491,"xpu_worker":492,"gpu_worker":493,"tpu_model_runner":494,"block_table":495,"metadata":496,"ngram_proposer":497,"flex_attention":498,"mamba_selectors":499,"mamba1_attn":500,"linear_attn":501,"tree_attn":502,"rocm_aiter_fa":503,"triton_attn":504,"mamba2_attn":505,"pallas":506,"cpu_attn":507,"cutlass_mla":508,"backend_xgrammar":509,"backend_outlines":510,"backend_guidance":511,"backend_types":512,"rejection_sampler":513,"sampler":514,"builtin":515,"state":516,"bad_words":517,"penalties":518,"topk_topp_sampler":519,"multiproc_executor":520,"ray_distributed_executor":521,"single_type_kv_cache_manager":522,"kv_cache_manager":523,"kv_cache_coordinator":524,"block_pool":525,"encoder_cache_manager":526,"kv_cache_utils":527,"scheduler":528,"request_queue":529,"output":530,"async_scheduler":531,"importing":532,"jsontree":533,"tensor_schema":534,"deep_gemm":535,"ray_env":536,"lazy_utils":537,"compilation":538,"parallel":539,"uniproc_executor":540,"executor_base":541,"mp_distributed_executor":542,"ray_utils":543,"msgspec_utils":544,"multiproc_worker_utils":545,"placeholder_block_space_manager":546,"block_manager":547,"evictor":548,"prefix_caching_block":549,"naive_block":550,"cpu_gpu_block_allocator":551,"monitor":552,"wrapper":553,"noop_elimination":554,"activation_quant_fusion":555,"base_static_graph":556,"counter":557,"cuda_graph":558,"fusion":559,"decorators":560,"fx_utils":561,"pass_manager":562,"compiler_interface":563,"torch25_custom_graph_pass":564,"fix_functionalization":565,"collective_fusion":566,"backends":567,"fusion_attn":568,"inductor_pass":569,"multi_output_match":570,"sequence_parallelism":571,"vllm_inductor_pass":572,"cuda_piecewise_backend":573,"custom_op":574,"pooling_metadata":575,"parameter":576,"sampling_metadata":577,"weight_utils":578,"dummy_loader":579,"neuronx_distributed":580,"base_loader":581,"bitsandbytes_loader":582,"sharded_state_loader":583,"tensorizer_loader":584,"runai_streamer_loader":585,"gguf_loader":586,"default_loader":587,"layernorm":588,"logits_processor":589,"resampler":590,"activation":591,"pooler":592,"vocab_parallel_embedding":593,"lightning_attn":594,"linear":595,"phi3_long_rope_scaled_rope":596,"dynamic_ntk_alpha_rope":597,"linear_scaling_rope":598,"yarn_scaling_rope":599,"mrope":600,"llama4_vision_rope":601,"llama3_rope":602,"deepseek_scaling_rope":603,"dual_chunk_rope":604,"ntk_scaling_rope":605,"dynamic_ntk_scaling_rope":606,"flashinfer_cutlass_moe":607,"triton_deep_gemm_moe":608,"prepare_finalize":609,"fused_moe":610,"cutlass_moe":611,"moe_permute_unpermute":612,"moe_align_block_size":613,"moe_pallas":614,"flashinfer_cutlass_prepare_finalize":615,"deep_gemm_moe":616,"deepep_ll_prepare_finalize":617,"fused_batched_moe":618,"modular_kernel":619,"routing_simulator":620,"fused_marlin_moe":621,"deepep_ht_prepare_finalize":622,"cpu_fused_moe":623,"rocm_aiter_fused_moe":624,"moe_torch_iterative":625,"batched_deep_gemm_moe":626,"pplx_prepare_finalize":627,"gpt_oss_triton_kernels_moe":628,"batched_triton_or_deep_gemm_moe":629,"deep_gemm_utils":630,"topk_weight_and_reduce":631,"16384":632,"device_name":633,"amd_instinct_mi325x":634,"json":635,"dtype":636,"fp8_w8a8":637,"2048":638,"nvidia_h100_80gb_hbm3":639,"256":640,"amd_instinct_mi300x":641,"block_shape":642,"128":643,"60":644,"704":645,"3584":646,"nvidia_a100":647,"sxm4":648,"80gb":649,"1792":650,"nvidia_h200":651,"160":652,"192":653,"nvidia_a800":654,"40gb":655,"16":656,"2688":657,"4096":658,"64":659,"896":660,"nvidia_h20":661,"14336":662,"int8_w8a16":663,"768":664,"384":665,"72":666,"7168":667,"int8_w8a8":668,"1344":669,"1024":670,"nvidia_b200":671,"640":672,"nvidia_geforce_rtx_4090":673,"1408":674,"3072":675,"8192":676,"320":677,"3e":678,"512":679,"amd_instinct_mi325_oam":680,"62":681,"6400":682,"352":683,"2560":684,"800":685,"nvidia_h100":686,"176":687,"1280":688,"96":689,"nvidia_l40s":690,"1536":691,"nvidia_l20":692,"3200":693,"20":694,"nvidia_l20y":695,"mxfp4":696,"bitsandbytes":697,"awq":698,"kv_cache":699,"awq_triton":700,"input_quant_fp8":701,"neuron_quant":702,"experts_int8":703,"schema":704,"base_config":705,"gptq_marlin":706,"ptpc_fp8":707,"marlin":708,"ipex_quant":709,"deepgemm":710,"deepspeedfp":711,"gptq_marlin_24":712,"gptq_bitblas":713,"tpu_int8":714,"qqq":715,"fbgemm_fp8":716,"moe_wna16":717,"hqq_marlin":718,"awq_marlin":719,"rtn":720,"gptq":721,"conch":722,"allspark":723,"machete":724,"dynamic_4bit":725,"exllama":726,"mplinearkernel":727,"cutlass":728,"xla":729,"aiter":730,"scaledmmlinearkernel":731,"compressed_tensors":732,"compressed_tensors_moe":733,"triton_scaled_mm":734,"compressed_tensors_w4a16_24":735,"compressed_tensors_wna16":736,"compressed_tensors_w8a8_int8":737,"compressed_tensors_w4a4_nvfp4":738,"compressed_tensors_24":739,"compressed_tensors_w4a16_nvfp4":740,"compressed_tensors_w8a8_fp8":741,"compressed_tensors_w4a8_int":742,"compressed_tensors_scheme":743,"compressed_tensors_w8a16_fp8":744,"flashinfer_fp4_moe":745,"int8_utils":746,"allspark_utils":747,"marlin_utils":748,"fp8_utils":749,"nvfp4_emulation_utils":750,"w8a8_utils":751,"marlin_utils_fp8":752,"gptq_utils":753,"nvfp4_moe_support":754,"flashinfer_utils":755,"quant_utils":756,"marlin_utils_test":757,"mxfp4_utils":758,"machete_utils":759,"marlin_utils_test_24":760,"bitblas_utils":761,"marlin_utils_fp4":762,"layer_utils":763,"marlin_utils_test_qqq":764,"1152":765,"24576":766,"18432":767,"576":768,"36864":769,"32768":770,"2304":771,"4608":772,"quark_moe":773,"quark_w8a8_int8":774,"quark_w8a8_fp8":775,"quark_scheme":776,"quark_w4a4_mxfp4":777,"mamba_mixer":778,"mamba_mixer2":779,"mamba2_metadata":780,"mamba_utils":781,"ssd_chunk_scan":782,"mamba_ssm":783,"ssd_bmm":784,"ssd_chunk_state":785,"layernorm_gated":786,"ssd_state_passing":787,"ssd_combined":788,"causal_conv1d":789,"kernel_warmup":790,"deep_gemm_warmup":791,"siglip":792,"llava":793,"internlm2_ve":794,"molmo":795,"florence2":796,"glm4_moe":797,"aimv2":798,"mistral3":799,"aria":800,"minimax_text_01":801,"jina_vl":802,"persimmon":803,"jamba":804,"smolvlm":805,"minicpm_eagle":806,"gpt2":807,"granite":808,"gpt_neox":809,"minicpm":810,"clip":811,"bart":812,"hyperclovax_vision":813,"starcoder2":814,"fuyu":815,"phi3":816,"falcon_h1":817,"phi4mm_utils":818,"roberta":819,"blip2":820,"minimax_vl_01":821,"h2ovl":822,"bert":823,"qwen2":824,"mamba_cache":825,"llama4_eagle":826,"glm4":827,"phimoe":828,"keye":829,"ernie45_moe":830,"mixtral":831,"mamba2":832,"phi4flash":833,"pixtral":834,"telechat2":835,"gemma3":836,"gpt_bigcode":837,"fairseq2_llama":838,"olmoe":839,"bamba":840,"deepseek_v2":841,"bailing_moe":842,"module_mapping":843,"cohere2_vision":844,"nvlm_d":845,"glm4v":846,"gemma3n_mm":847,"qwen3_moe":848,"gemma":849,"constant_size_cache":850,"qwen2_rm":851,"llava_next_video":852,"llava_next":853,"step3_text":854,"whisper":855,"interns1":856,"aya_vision":857,"qwen2_5_vl":858,"dbrx":859,"baichuan":860,"llama4":861,"zamba2":862,"opt":863,"internlm2":864,"phi3v":865,"qwen":866,"llava_onevision":867,"olmo2":868,"glm4_1v":869,"tarsier":870,"interns1_vit":871,"gpt_oss":872,"gemma2":873,"deepseek_mtp":874,"glm":875,"qwen2_moe":876,"voxtral":877,"paligemma":878,"interfaces_base":879,"idefics3":880,"skyworkr1v":881,"mixtral_quant":882,"adapters":883,"vision":884,"commandr":885,"chameleon":886,"granitemoe":887,"minicpm3":888,"mpt":889,"phi4mm_audio":890,"minicpmo":891,"glm4_moe_mtp":892,"bloom":893,"ernie45":894,"plamo2":895,"llama_eagle3":896,"transformers":897,"granitemoeshared":898,"phi4mm":899,"solar":900,"mllama":901,"granitemoehybrid":902,"mimo_mtp":903,"bert_with_rope":904,"phi":905,"qwen2_vl":906,"idefics2_vision_model":907,"mllama4":908,"granite_speech":909,"exaone4":910,"deepseek":911,"exaone":912,"qwen3":913,"blip":914,"dots1":915,"olmo":916,"teleflm":917,"gritlm":918,"minicpmv":919,"qwen2_5_omni_thinker":920,"prithvi_geospatial_mae":921,"modernbert":922,"gpt_j":923,"orion":924,"intern_vit":925,"internvl":926,"qwen2_audio":927,"stablelm":928,"gemma3_mm":929,"mimo":930,"mamba":931,"grok1":932,"minimax_cache":933,"qwen_vl":934,"arcee":935,"llama_eagle":936,"hunyuan_v1":937,"nemotron_nas":938,"llama":939,"phi4_multimodal":940,"gemma3n":941,"benchmark_prioritization":942,"sonnet":943,"benchmark_ngram_proposer":944,"benchmark_long_document_qa_throughput":945,"benchmark_serving":946,"benchmark_latency":947,"benchmark_prefix_caching":948,"backend_request_func":949,"run_structured_output_benchmark":950,"benchmark_block_pool":951,"benchmark_throughput":952,"benchmark_serving_structured_output":953,"benchmark_utils":954,"benchmark_dataset":955,"bench_dataset":956,"requirements":957,"benchmark_serving_multi_turn":958,"convert_sharegpt_to_openai":959,"generate_multi_turn":960,"bench_utils":961,"auto_tune":962,"benchmark_w8a8_block_fp8":963,"benchmark_trtllm_decode_attention":964,"benchmark_quant":965,"benchmark_grouped_gemm_cutlass":966,"benchmark_per_token_group_quant":967,"benchmark_paged_attention":968,"benchmark_marlin":969,"benchmark_mrope":970,"benchmark_rmsnorm":971,"benchmark_layernorm":972,"benchmark_lora":973,"weight_shapes":974,"benchmark_bitblas":975,"benchmark_moe_permute_unpermute":976,"benchmark_cutlass_fp4_moe":977,"benchmark_rope":978,"benchmark_reshape_and_cache_flash":979,"bench_per_token_quant_fp8":980,"bench_nvfp4_gemm":981,"bench_fp8_gemm":982,"benchmark_machete":983,"benchmark_shapes":984,"graph_machete_bench":985,"benchmark_moe":986,"benchmark_trtllm_prefill_attention":987,"benchmark_moe_align_block_size":988,"bench_int8_gemm":989,"benchmark_fp8_block_dense_gemm":990,"w8a8_benchmarks":991,"sparse_benchmarks":992,"disagg_performance_benchmark":993,"disagg_prefill_proxy_server":994,"rate_limiter":995,"visualize_benchmark_results":996,"disagg_overhead_benchmark":997,"round_robin_proxy":998,"benchmark_hashing":999,"structured_schema_1":1000,"layernorm_rms_benchmarks":1001,"cmake":1002,"hipify":1003,"cpu_extension":1004,"vllm_flash_attn":1005,"tool_chat_template_granite":1006,"tool_chat_template_llama3":1007,"1_json":1008,"tool_chat_template_mistral":1009,"template_chatglm2":1010,"tool_chat_template_llama4_json":1011,"template_teleflm":1012,"template_dse_qwen2_vl":1013,"tool_chat_template_toolace":1014,"tool_chat_template_xlam_llama":1015,"tool_chat_template_mistral3":1016,"tool_chat_template_mistral_parallel":1017,"tool_chat_template_hunyuan_a13b":1018,"tool_chat_template_llama4_pythonic":1019,"template_chatglm":1020,"2_pythonic":1021,"tool_chat_template_granite_20b_fc":1022,"tool_chat_template_hermes":1023,"2_json":1024,"tool_chat_template_deepseekv3":1025,"template_inkbot":1026,"tool_chat_template_minimax_m1":1027,"tool_chat_template_xlam_qwen":1028,"tool_chat_template_internlm2_tool":1029,"template_falcon":1030,"template_alpaca":1031,"template_vlm2vec":1032,"template_falcon_180b":1033,"tool_chat_template_phi4_mini":1034,"template_baichuan":1035,"tool_chat_template_deepseekr1":1036,"logging_configuration":1037,"tensorize_vllm_model":1038,"disagg_prefill_lmcache_v0":1039,"kv_cache_sharing_lmcache_v1":1040,"cpu_offload_lmcache":1041,"disagg_example_nixl":1042,"disagg_proxy_server":1043,"disagg_vllm_launcher":1044,"lmcache":1045,"decoder":1046,"prefiller":1047,"api_client":1048,"openai_chat_completion_client_with_tools_xlam":1049,"openai_chat_completion_with_reasoning_streaming":1050,"openai_embedding_client":1051,"openai_chat_completion_with_reasoning":1052,"multi_instance_data_parallel":1053,"openai_chat_completion_client_for_multimodal":1054,"openai_chat_completion_client":1055,"prompt_embed_inference_with_openai_client":1056,"retrieval_augmented_generation_with_llamaindex":1057,"cohere_rerank_client":1058,"openai_chat_completion_client_with_tools_xlam_streaming":1059,"gradio_openai_chatbot_webserver":1060,"gradio_webserver":1061,"openai_pooling_client":1062,"kv_events_subscriber":1063,"openai_translation_client":1064,"sagemaker":1065,"entrypoint":1066,"openai_completion_client":1067,"disaggregated_prefill":1068,"openai_cross_encoder_score_for_multimodal":1069,"openai_chat_completion_client_with_tools":1070,"openai_cross_encoder_score":1071,"openai_transcription_client":1072,"retrieval_augmented_generation_with_langchain":1073,"openai_classification_client":1074,"openai_chat_completion_tool_calls_with_reasoning":1075,"openai_chat_embedding_client_for_multimodal":1076,"streamlit_openai_chatbot_webserver":1077,"openai_chat_completion_client_with_tools_required":1078,"multi":1079,"node":1080,"serving":1081,"ray_serve_deepseek":1082,"run_cluster":1083,"jinaai_rerank_client":1084,"openai_embedding_matryoshka_fy":1085,"disagg_proxy_demo":1086,"serve_deepseek_v2":1087,"bench":1088,"scale":1089,"disagg_proxy_p2p_nccl_xpyd":1090,"disagg_example_p2p_nccl_xpyd":1091,"chart":1092,"values":1093,"helmignore":1094,"lintconf":1095,"ct":1096,"poddisruptionbudget":1097,"service":1098,"job":1099,"configmap":1100,"deployment":1101,"hpa":1102,"custom":1103,"objects":1104,"_helpers":1105,"tpl":1106,"pvc":1107,"secrets":1108,"compose":1109,"grafana":1110,"dummy_client":1111,"async_llm_streaming":1112,"batch_llm_inference":1113,"qwen3_reranker":1114,"chat_with_tools":1115,"vision_language_pooling":1116,"save_sharded_state":1117,"encoder_decoder_multimodal":1118,"rlhf_colocate":1119,"vision_language":1120,"mlpspeculator":1121,"embed_jina_embeddings_v3":1122,"skip_loading_weights_in_engine_init":1123,"torchrun_example":1124,"data_parallel":1125,"simple_profiling":1126,"neuron_speculation":1127,"convert_model_to_seq_cls":1128,"rlhf_utils":1129,"embed_matryoshka_fy":1130,"neuron_multimodal":1131,"llm_engine_example":1132,"prompt_embed_inference":1133,"audio_language":1134,"small":1135,"neuron_eagle":1136,"encoder_decoder":1137,"context_extension":1138,"lora_with_quantization_inference":1139,"multilora_inference":1140,"qwen_1m":1141,"load_sharded_state":1142,"vision_language_multi_image":1143,"neuron_int8_quantization":1144,"only_thinker":1145,"reward":1146,"classify":1147,"embed":1148,"generate":1149,"score":1150,"openai_example_batch":1151,"jsonl":1152,"prefill_example":1153,"decode_example":1154,"check":1155,"wheel":1156,"size":1157,"generate_index":1158,"test":1159,"pipeline":1160,"rerun":1161,"ci":1162,"clean":1163,"log":1164,"wheels":1165,"annotate":1166,"hpu":1167,"v1":1168,"amd":1169,"ppc64le":1170,"gh200":1171,"part2":1172,"config_v6e_1":1173,"env":1174,"docker_run_bm":1175,"quantized_v6e_1":1176,"cleanup_docker":1177,"run_bm":1178,"conftest":1179,"test_lm_eval_correctness":1180,"lm":1181,"eval":1182,"gsm":1183,"hf":1184,"baseline":1185,"qwen1":1186,"moe":1187,"w4a16":1188,"compressed":1189,"tensors":1190,"70b":1191,"instruct":1192,"fbgemm":1193,"nonuniform":1194,"vl":1195,"3b":1196,"dynamic":1197,"8b":1198,"channelwise":1199,"8x7b":1200,"v0":1201,"v2":1202,"lite":1203,"sparsellama3":1204,"1_2of4_fp8_compressed":1205,"8x22b":1206,"5b":1207,"w8a16":1208,"asym":1209,"1b":1210,"fp8w8":1211,"large":1212,"minitron":1213,"4b":1214,"57b":1215,"a14":1216,"benchmark":1217,"nightly":1218,"annotation":1219,"performance":1220,"descriptions":1221,"markdown":1222,"compare":1223,"results":1224,"launch":1225,"server":1226,"summary":1227,"download":1228,"get":1229,"lmdeploy":1230,"modelname":1231,"convert":1232,"wait":1233,"snc2":1234,"genai":1235,"perf":1236,"snc3":1237,"kv_connectors":1238,"nightly_torch_test":1239,"docs":1240,"dev":1241,"lint":1242,"generate_cmake_presets":1243,"shellcheck":1244,"check_repo":1245,"check_init_lazy_imports":1246,"enforce_regex_import":1247,"install_nixl":1248,"update":1249,"graph":1250,"validate_config":1251,"check_triton_import":1252,"check_pickle_imports":1253,"check_spdx_header":1254,"report_build_time_ninja":1255,"generate_nightly_torch_test":1256,"mypy":1257,"configure_system_drivers":1258,"install_python_libraries":1259,"eep_nvshmem":1260,"patch":1261,"install_eep_libraries":1262,"print_layerwise_table":1263,"visualize_layerwise_profile":1264,"gputrc2graph":1265,"csv1":1266,"html_tbl":1267,"cuh":1268,"custom_all_reduce_test":1269,"cu":1270,"cumem_allocator":1271,"cpp":1272,"cuda_utils":1273,"layernorm_kernels":1274,"cuda_utils_kernels":1275,"cuda_compat":1276,"cuda_view":1277,"layernorm_quant_kernels":1278,"type_convert":1279,"torch_bindings":1280,"dispatch_utils":1281,"activation_kernels":1282,"custom_quickreduce":1283,"cache_kernels":1284,"permute_cols":1285,"ops":1286,"pos_encoding_kernels":1287,"moe_align_sum_kernels":1288,"topk_softmax_kernels":1289,"moe_wna16_utils":1290,"moe_permute_unpermute_op":1291,"moe_ops":1292,"moe_permute_unpermute_kernel":1293,"inl":1294,"dispatch":1295,"generate_kernels":1296,"marlin_template":1297,"kernel":1298,"cpu_types_vsx":1299,"hpp":1300,"cpu_types_x86":1301,"quant":1302,"attention":1303,"cpu_types":1304,"mla_decode":1305,"cpu_types_vxe":1306,"cpu_types_arm":1307,"dnnl_helper":1308,"shm":1309,"pos_encoding":1310,"vec":1311,"moe_int8":1312,"gemm_int8":1313,"gemm":1314,"gemm_fp8":1315,"moe_fp8":1316,"sparse_scaled_mm_c3x":1317,"sparse_scaled_mm_entry":1318,"sparse_compressor_c3x":1319,"paged_attention_v1":1320,"dtype_float32":1321,"attention_kernels":1322,"dtype_fp8":1323,"paged_attention_v2":1324,"vertical_slash_index":1325,"dtype_float16":1326,"attention_dtypes":1327,"attention_utils":1328,"attention_generic":1329,"dtype_bfloat16":1330,"cutlass_mla_kernels":1331,"sm100_cutlass_mla_kernel":1332,"cutlass_mla_entry":1333,"sm100_mla":1334,"sm100_fmha_mla_tma_warpspecialized":1335,"sm100_mla_tile_scheduler":1336,"sm100_fmha_mla_reduction":1337,"vectorization_utils":1338,"per_token_group_quant_8bit":1339,"vectorization":1340,"marlin_dtypes":1341,"dequant":1342,"gptq_marlin_repack":1343,"awq_marlin_repack":1344,"allspark_qgemm_w8a16":1345,"allspark_repack":1346,"gemm_kernels":1347,"dequantize":1348,"scaled_mm_c3x_sm90":1349,"scaled_mm_c2x_sm75_dispatch":1350,"scaled_mm_c2x":1351,"scaled_mm_c2x_sm89_fp8_dispatch":1352,"scaled_mm_c3x_sm120":1353,"scaled_mm_entry":1354,"scaled_mm_c3x_sm100":1355,"scaled_mm_c2x_sm80_dispatch":1356,"epilogues":1357,"scaled_mm_c2x_sm89_int8_dispatch":1358,"get_group_starts":1359,"grouped_mm_c3x_sm90":1360,"grouped_mm_c3x":1361,"moe_data":1362,"grouped_mm_c3x_sm100":1363,"blockwise_scaled_group_mm_sm100":1364,"scaled_mm_sm120_fp8":1365,"scaled_mm_sm100_fp8":1366,"scaled_mm_blockwise_sm90_fp8":1367,"scaled_mm_sm90_fp8_dispatch":1368,"scaled_mm_azp_sm90_int8":1369,"scaled_mm_blockwise_sm100_fp8":1370,"scaled_mm_sm120_fp8_dispatch":1371,"scaled_mm_kernels":1372,"scaled_mm_sm90_int8_dispatch":1373,"scaled_mm_blockwise_sm120_fp8_dispatch":1374,"scaled_mm":1375,"scaled_mm_blockwise_sm100_fp8_dispatch":1376,"scaled_mm_blockwise_sm90_fp8_dispatch":1377,"scaled_mm_helper":1378,"scaled_mm_blockwise_sm120_fp8":1379,"cutlass_gemm_caller":1380,"scaled_mm_sm100_fp8_dispatch":1381,"scaled_mm_sm90_fp8":1382,"scaled_mm_sm90_int8":1383,"nvfp4_quant_entry":1384,"nvfp4_blockwise_moe_kernel":1385,"nvfp4_scaled_mm_sm120_kernels":1386,"nvfp4_quant_kernels":1387,"nvfp4_experts_quant":1388,"nvfp4_scaled_mm_kernels":1389,"nvfp4_scaled_mm_entry":1390,"marlin_24_cuda_kernel":1391,"mma":1392,"mem":1393,"marlin_qqq_gemm_kernel":1394,"marlin_cuda_kernel":1395,"ggml":1396,"mmq":1397,"vecdotq":1398,"mmvq":1399,"gguf_kernel":1400,"moe_vec":1401,"int8_quant_kernels":1402,"layernorm_utils":1403,"quant_conversions":1404,"fused_layernorm_dynamic_per_token_quant":1405,"per_token_group_quant":1406,"machete_prepack_launcher":1407,"machete_prepacked_layout":1408,"machete_pytorch":1409,"machete_mm_kernel":1410,"machete_collective_builder":1411,"machete_mainloop":1412,"machete_prepack_kernel":1413,"machete_mm_launcher":1414,"machete_interleaving_utils":1415,"qdq_8":1416,"matrix_view":1417,"q_gemm":1418,"compat":1419,"qdq_2":1420,"qdq_util":1421,"qdq_3":1422,"qdq_4":1423,"quick_reduce_impl":1424,"quick_reduce":1425,"vllm_numeric_conversion":1426,"vllm_custom_types":1427,"vllm_collective_builder":1428,"torch_utils":1429,"vllm_type_utils":1430,"cute_utils":1431,"vllm_cutlass_library_extension":1432,"dispatch_policy":1433,"sm90_mma_tma_gmma_ss_warpspecialized_fp8_blockwise_scaling":1434,"collective_builder":1435,"fp8_accumulation":1436,"broadcast_load_epilogue_array_c3x":1437,"scaled_mm_epilogues_c2x":1438,"broadcast_load_epilogue_c3x":1439,"scaled_mm_epilogues_c3x":1440,"broadcast_load_epilogue_c2x":1441,"skinny_gemms":1442,"math":1443,"exception":1444,"static_switch":1445,"selective_scan":1446,"selective_scan_fwd":1447,"nightly_torch":1448,"rocm_base":1449,"test_inputs":1450,"test_outputs":1451,"test_logger":1452,"test_vllm_port":1453,"test_scalartype":1454,"test_routing_simulator":1455,"test_seed_behavior":1456,"test_embedded_commit":1457,"test_sampling_params":1458,"test_pooling_params":1459,"test_triton_utils":1460,"test_regression":1461,"test_config":1462,"test_sharded_state_loader":1463,"test_test":1464,"test_cache_block_hashing":1465,"build_cython":1466,"test_version":1467,"test_sequence":1468,"test_request_tracker":1469,"test_api_server":1470,"api_server_async_engine":1471,"test_metrics":1472,"test_chat_utils":1473,"test_ssl_cert_refresher":1474,"test_api_server_process_manager":1475,"test_score":1476,"test_collective_rpc":1477,"test_accuracy":1478,"test_classify":1479,"test_gpu_utilization":1480,"test_reward":1481,"test_lazy_outlines":1482,"test_chat":1483,"test_encode":1484,"test_embedding":1485,"test_prompt_validation":1486,"test_generate_multiple_loras":1487,"test_generate":1488,"test_offline_mode":1489,"test_pooling":1490,"test_sleep":1491,"test_rerank":1492,"test_chat_echo":1493,"test_lora_adapters":1494,"test_return_tokens_as_ids":1495,"test_oot_registration":1496,"test_classification":1497,"test_tensorizer_entrypoint":1498,"test_embedding_long_text":1499,"test_uds":1500,"test_run_batch":1501,"test_basic":1502,"test_vision":1503,"test_encoder_decoder":1504,"test_cli_args":1505,"test_tokenization":1506,"test_transcription_validation":1507,"test_lora_resolvers":1508,"test_serving_chat":1509,"test_default_mm_loras":1510,"test_openai_schema":1511,"test_chat_template":1512,"test_translation_validation":1513,"test_chat_with_tool_reasoning":1514,"test_video":1515,"test_async_tokenization":1516,"test_response_api_with_harmony":1517,"test_shutdown":1518,"test_vision_embedding":1519,"test_embedding_dimensions":1520,"test_completion_with_prompt_embeds":1521,"test_completion":1522,"test_completion_with_function_calling":1523,"test_chunked_prompt":1524,"test_root_path":1525,"test_skip_tokenizer":1526,"test_models":1527,"test_serving_models":1528,"test_audio":1529,"test_truncation":1530,"test_optional_middleware":1531,"test_chat_logit_bias_validation":1532,"test_llama3_json_tool_parser":1533,"test_hunyuan_a13b_tool_parser":1534,"test_llama4_pythonic_tool_parser":1535,"test_hermes_tool_parser":1536,"test_pythonic_tool_parser":1537,"test_mteb_score":1538,"test_mteb_embed":1539,"test_transcription_api_correctness":1540,"test_lmeval":1541,"test_computed_prefix_blocks":1542,"test_executor":1543,"test_multiproc_workers":1544,"test_short_mm_context":1545,"test_options":1546,"test_arg_utils":1547,"test_lora_manager":1548,"test_peft_helper":1549,"test_multi_loras_with_tp":1550,"test_minicpmv_tp":1551,"test_layers":1552,"test_lora_huggingface":1553,"test_baichuan":1554,"test_tokenizer_group":1555,"test_mixtral":1556,"test_lora_functions":1557,"test_worker":1558,"test_chatglm3_tp":1559,"test_lora_checkpoints":1560,"test_phi":1561,"test_resolver":1562,"test_transformers_model":1563,"test_lora_allowed_token_ids":1564,"test_punica_ops":1565,"test_quant_model":1566,"test_add_lora":1567,"test_qwen2vl":1568,"test_llama_tp":1569,"test_throughput_cli":1570,"test_latency_cli":1571,"test_serve_cli":1572,"test_swap":1573,"test_model_input":1574,"test_profile":1575,"test_model_runner":1576,"test_encoder_decoder_model_runner":1577,"test_cuda_context":1578,"test_tensorizer":1579,"test_tracing":1580,"test_parallel_tool_calls":1581,"test_xlam_tool_parser":1582,"test_tool_choice_required":1583,"test_jamba_tool_parser":1584,"test_kimi_k2_tool_parser":1585,"test_chat_completion_request_validations":1586,"test_qwen3coder_tool_parser":1587,"test_glm4_moe_tool_parser":1588,"test_chat_completions":1589,"test_tool_calls":1590,"test_minimax_tool_parser":1591,"test_module":1592,"test_lookup_buffer":1593,"test_send_recv":1594,"test_eagle3":1595,"test_ranks":1596,"test_no_bad_words":1597,"test_ignore_eos":1598,"test_logprobs":1599,"test_beam_search":1600,"test_sampler":1601,"test_seeded_generate":1602,"test_tokenizer":1603,"test_detokenize":1604,"test_get_eos":1605,"test_cached_tokenizer":1606,"test_tokenizer_registry":1607,"test_mistral_tokenizer":1608,"test_do_lower_case":1609,"test_tensor_schema":1610,"my_gemma_embedding":1611,"my_llava":1612,"my_opt":1613,"test_filesystem_resolver":1614,"dummy_attention_backend":1615,"dummy_platform":1616,"dummy_custom_ops":1617,"test_runai_model_streamer_loader":1618,"test_weight_utils":1619,"test_preemption":1620,"test_cpu_offload":1621,"test_chunked_prefill":1622,"test_cumem":1623,"test_basic_correctness":1624,"test_image":1625,"test_cache":1626,"test_registry":1627,"test_hasher":1628,"test_processing":1629,"image2":1630,"rgba":1631,"image1":1632,"test_multi_node_assignment":1633,"test_ca_buffer_sharing":1634,"test_eplb_algo":1635,"test_sequence_parallel":1636,"test_pipeline_parallel":1637,"test_pp_cudagraph":1638,"test_kvlayout":1639,"test_pynccl":1640,"test_eplb_execute":1641,"test_node_count":1642,"test_distributed_oot":1643,"test_expert_parallel":1644,"test_comm_ops":1645,"test_same_node":1646,"test_shm_broadcast":1647,"test_torchrun_example":1648,"test_pipeline_partition":1649,"test_events":1650,"test_custom_all_reduce":1651,"test_quick_all_reduce":1652,"lazy_imports":1653,"python_only_compile":1654,"pytorch_nightly_dependency":1655,"reference_mxfp4":1656,"test_ptpc_fp8":1657,"test_rtn":1658,"test_configs":1659,"test_modelopt":1660,"test_fp8":1661,"test_lm_head":1662,"test_experts_int8":1663,"test_ipex_quant":1664,"test_gptq_dynamic":1665,"test_torchao":1666,"test_auto_round":1667,"test_compressed_tensors":1668,"test_quark":1669,"test_register_quantization_config":1670,"test_qwen3_reasoning_parser":1671,"test_mistral_reasoning_parser":1672,"test_hunyuan_reasoning_parser":1673,"test_granite_reasoning_parser":1674,"test_deepseekr1_reasoning_parser":1675,"test_prefix_caching":1676,"test_disable_sliding_window":1677,"test_weight_loading":1678,"run_model_weight_loading_test":1679,"test_fused_quant_activation":1680,"test_triton_flash_attention":1681,"test_shuffle_rows":1682,"test_flex_attention":1683,"allclose_default":1684,"test_apply_repetition_penalties":1685,"test_cutlass_mla_decode":1686,"test_silu_mul_fp8_quant_deep_gemm":1687,"test_batched_deepgemm":1688,"test_nvfp4_moe":1689,"test_block_int8":1690,"test_moe_permute_unpermute":1691,"test_count_expert_num_tokens":1692,"test_moe":1693,"parallel_utils":1694,"test_gpt_oss_triton_kernels":1695,"test_cutlass_grouped_gemm":1696,"test_deepep_deepgemm_moe":1697,"test_pplx_cutlass_moe":1698,"test_moe_align_block_size":1699,"test_deepgemm":1700,"test_rocm_aiter_topk":1701,"test_block_fp8":1702,"test_flashinfer_moe":1703,"test_pplx_moe":1704,"test_cutlass_moe":1705,"test_triton_moe_ptpc_fp8":1706,"test_deepep_moe":1707,"test_mxfp4_moe":1708,"test_modular_kernel_combinations":1709,"test_batched_moe":1710,"mk_objects":1711,"make_feature_matrix":1712,"profile_modular_kernel":1713,"test_flash_attn":1714,"test_mha_attn":1715,"test_cascade_flash_attn":1716,"test_aiter_flash_attn":1717,"test_flashmla":1718,"test_flashinfer":1719,"test_mla_decode_cpu":1720,"test_merge_attn_states":1721,"test_triton_unified_attention":1722,"test_prefix_prefill":1723,"test_triton_decode_attention":1724,"test_rocm_attention_selector":1725,"test_lightning_attn":1726,"test_flashinfer_trtllm_attention":1727,"test_attention":1728,"test_attention_selector":1729,"test_encoder_decoder_attn":1730,"test_awq":1731,"test_triton_scaled_mm":1732,"test_cutlass_2of4_sparse":1733,"test_nvfp4_quant":1734,"test_awq_triton":1735,"test_rocm_skinny_gemms":1736,"test_int8_kernel":1737,"test_machete_mm":1738,"test_nvfp4_scaled_mm":1739,"test_flashinfer_nvfp4_scaled_mm":1740,"test_gptq":1741,"test_allspark_gemm":1742,"test_int8_quant":1743,"test_ggml":1744,"test_marlin_gemm":1745,"test_gguf":1746,"nvfp4_utils":1747,"test_cutlass_scaled_mm":1748,"test_per_token_group_quant":1749,"test_fp8_quant":1750,"test_opcheck":1751,"test_permute_cols":1752,"test_uva":1753,"test_layernorm":1754,"test_rotary_embedding":1755,"test_pos_encoding":1756,"test_mrope":1757,"test_fused_quant_layernorm":1758,"test_activation":1759,"test_causal_conv1d":1760,"test_mamba_ssm_ssd":1761,"test_mamba_mixer2":1762,"test_mamba_ssm":1763,"test_multi_lora":1764,"test_mistral":1765,"test_eagle":1766,"test_neuron_model_runner":1767,"test_block_table":1768,"test_logits_processor":1769,"test_neuron_quant":1770,"test_transformers":1771,"test_initialization":1772,"pixtral_chat":1773,"mistral_small_3_chat":1774,"test_mapping":1775,"test_mllama4":1776,"test_smolvlm":1777,"test_internvl":1778,"test_h2ovl":1779,"test_llava_onevision":1780,"test_common":1781,"test_idefics3":1782,"test_phi3v":1783,"test_llava_next":1784,"test_mllama":1785,"test_llama4":1786,"test_phi4mm":1787,"test_nemotron_vl":1788,"test_qwen2_vl":1789,"test_minimax_vl_01":1790,"test_glm4_1v":1791,"test_intern_vit":1792,"test_dse_qwen2_vl":1793,"test_jinavl_reranker":1794,"test_prithvi_mae":1795,"test_whisper":1796,"test_interleaved":1797,"test_granite_speech":1798,"test_ultravox":1799,"test_phi4_multimodal":1800,"test_pixtral":1801,"test_maverick":1802,"test_florence2":1803,"test_voxtral":1804,"runners":1805,"model_utils":1806,"custom_inputs":1807,"builders":1808,"case_filtering":1809,"test_gptq_bitblas":1810,"test_bitblas":1811,"test_mxfp4":1812,"test_gptq_marlin":1813,"test_gptq_marlin_24":1814,"test_nvfp4":1815,"test_bitsandbytes":1816,"mteb_utils":1817,"test_auto_prefix_cache_support":1818,"test_baai":1819,"test_gte":1820,"test_gritlm":1821,"test_jina":1822,"test_scoring":1823,"test_qwen3_reranker":1824,"test_nomic_max_model_len":1825,"test_cross_encoder":1826,"embed_utils":1827,"test_intfloat":1828,"test_bge_reranker_v2_gemma":1829,"test_snowflake_arctic_embed":1830,"test_nomic":1831,"test_mxbai_rerank":1832,"test_override_pooler_config":1833,"test_truncation_control":1834,"test_bart":1835,"test_mbart":1836,"test_gemma":1837,"test_hybrid":1838,"test_granite":1839,"test_phimoe":1840,"test_kv_sharing":1841,"test_async_llm_dp":1842,"test_request":1843,"test_serial_utils":1844,"test_hybrid_lb_dp":1845,"test_oracle":1846,"test_internal_lb_dp":1847,"test_metrics_reader":1848,"test_external_lb_dp":1849,"test_ray_metrics":1850,"test_cudagraph_dispatch":1851,"test_cudagraph_mode":1852,"test_struct_output_generate":1853,"test_completion_with_image_embeds":1854,"test_multi_api_servers":1855,"test_chat_completion":1856,"test_stateful":1857,"test_structured_output":1858,"test_cascade_attention":1859,"test_kv_sharing_fast_prefill":1860,"test_spec_decode":1861,"test_correctness_sliding_window":1862,"test_llm_engine":1863,"test_engine_core":1864,"test_engine_args":1865,"test_output_processor":1866,"test_async_llm":1867,"test_fast_incdec_prefix_err":1868,"test_engine_core_client":1869,"test_gpu_input_batch":1870,"test_gpu_model_runner":1871,"test_tree_attention":1872,"test_ngram":1873,"test_max_len":1874,"test_attention_backends":1875,"test_mamba_selectors":1876,"test_attention_splitting":1877,"test_chunked_local_attention":1878,"test_processor_error":1879,"test_startup_error":1880,"test_delete":1881,"test_forward_error":1882,"test_custom_online":1883,"test_custom_offline":1884,"test_correctness":1885,"test_shared_storage_connector":1886,"test_multi_connector":1887,"test_output_aggreagator":1888,"test_nixl_connector":1889,"test_remote_prefill_lifecycle":1890,"test_remote_decode_lifecycle":1891,"run_edge_case_test":1892,"run_accuracy_test":1893,"run_tpu_edge_case_test":1894,"run_tpu_disagg_accuracy_test":1895,"test_edge_cases":1896,"toy_proxy_server":1897,"test_disagg_accuracy":1898,"test_logprobs_e2e":1899,"test_rejection_sampler":1900,"test_sampling_params_e2e":1901,"test_topk_topp_sampler":1902,"test_scheduler":1903,"test_async_scheduler":1904,"test_scheduler_e2e":1905,"test_single_type_kv_cache_manager":1906,"test_kv_cache_utils":1907,"test_multimodal":1908,"test_pallas":1909,"test_tpu_qkv_linear":1910,"test_spmd_model_weight_loading":1911,"test_kv_cache_update_kernel":1912,"test_perf":1913,"test_tpu_int8":1914,"test_tpu_model_runner":1915,"test_mistral_tool_calls":1916,"sonnet3":1917,"5_nov2024":1918,"test_config_validator":1919,"blame":1920,"test_mp_reducer":1921,"test_config_generation":1922,"test_config_with_model":1923,"test_scheduler_plugins":1924,"test_platform_plugins":1925,"test_async_tp":1926,"test_full_graph":1927,"test_fusion_attn":1928,"test_fusion_all_reduce":1929,"test_sequence_parallelism":1930,"test_wrapper":1931,"backend":1932,"test_fusion":1933,"test_functionalization":1934,"test_pass_manager":1935,"test_silu_mul_quant_fusion":1936,"test_toy_llama":1937,"test_full_cudagraph":1938,"test_multiple_graphs":1939,"test_simple":1940,"test_scheduler_encoder_decoder":1941,"test_chunked_prefill_scheduler":1942,"test_num_computed_tokens_update":1943,"test_serialization":1944,"test_prefix_caching_block":1945,"test_cpu_gpu_block_allocator":1946,"test_block_manager":1947,"test_naive_block":1948,"test_compilation":1949,"test_moe_pallas":1950,"test_quantization_accuracy":1951,"test_custom_dispatcher":1952,"test_lora":1953,"test_load":1954,"test_error_handling":1955,"test_abort":1956,"test_fastsafetensors_loader":1957,"test_e2e_correctness":1958,"test_enabled_custom_ops":1959,"test_model_load_with_params":1960,"test_disable_detokenization":1961,"test_min_tokens":1962,"test_stop_strings":1963,"test_stop_reason":1964,"test_stop_checker":1965,"funding":1966,"mergify":1967,"pull_request_template":1968,"codeowners":1969,"dependabot":1970,"cleanup_pr_body":1971,"stale":1972,"add_label_automerge":1973,"reminder_comment":1974,"publish":1975,"deploy":1976,"create_release":1977,"pytorch":1978,"install":1979,"actionlint":1980,"200":1981,"installation":1982,"600":1983,"new":1984,"model":1985,"450":1986,"failure":1987,"500":1988,"feature":1989,"100":1990,"documentation":1991,"700":1992,"discussion":1993,"750":1994,"rfc":1995,"300":1996,"usage":1997,"400":1998,"bug":1999,"report":2000,"":2001}